pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
						</field>
						<field>
							<name>NORELOADH</name>
							<description>A 1 in this bit prevents the higher match registers from being  reloaded from their respective reload registers. Software can  write to set or clear this bit at any time. This bit is not used when  the UNIFY bit is set.</description>
							<bitRange>[8:8]</bitRange>
							
						</field>
						<field>
							<name>INSYNCn</name>
							<description>Synchronization for input n (bit 9 = input 0, bit 10 = input 1,..., bit 16 = input 7). A 1 in one of these bits subjects the corresponding input to  synchronization to the SCT clock, before it is used to create an  event. If an input is synchronous to the SCT clock, keep its bit 0 for  faster response. When the CKMODE field is 1x, the bit in this field, corresponding  to the input selected by the CKSEL field, is not used.</description>
							<bitRange>[16:9]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:17]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL</name>
					<description>SCT control register</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0x00040004</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DOWN_L</name>
							<description>This bit is 1 when the L or unified counter is counting down. It is set by hardware  when the counter's limit is reached and BIDIR is 1. It is cleared by  hardware when the counter reaches 0.</description>
							<bitRange>[0:0]</bitRange>
							
						</field>
						<field>
							<name>STOP_L</name>
							<description>When this bit is 1 and HALT is 0, the L or unified counter does not run but I/O  events related to the counter can occur. If such an event matches  the mask in the Start register, this bit is cleared and counting  resumes.</description>
							<bitRange>[1:1]</bitRange>
							
						</field>
						<field>
							<name>HALT_L</name>
							<description>When this bit is 1, the L or unified counter does not run and no events can occur.  This bit is set by reset.  Once set, this bit can only be cleared by software to restore counter operation.</description>
							<bitRange>[2:2]</bitRange>
							
						</field>
						<field>
							<name>CLRCTR_L</name>
							<description>Writing a 1 to this bit clears the L or unified counter. This bit always reads as 0.</description>
							<bitRange>[3:3]</bitRange>
							
						</field>
						<field>
							<name>BIDIR_L</name>
							<description>L or unified counter direction select</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>The counter counts up to its limit condition, then is cleared to zero.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUNTDOWN</name>
									<description>The counter counts up to its limit, then counts down to 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRE_L</name>
							<description>Specifies the factor by which the SCT clock is prescaled to produce the  L or unified counter clock. The counter clock will be clocked at the rate of the SCT  clock divided by PRE_L+1. Clear the counter (by writing a 1  to the CLRCTR bit) whenever changing the PRE value.</description>
							<bitRange>[12:5]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[15:13]</bitRange>
							
						</field>
						<field>
							<name>DOWN_H</name>
							<description>This bit is 1 when the H counter is counting down. It is set by hardware  when the counter's limit is reached and BIDIR is 1. It is cleared by  hardware when the counter reaches 0.</description>
							<bitRange>[16:16]</bitRange>
							
						</field>
						<field>
							<name>STOP_H</name>
							<description>When this bit is 1 and HALT is 0, the H counter does not run but I/O  events related to the counter can occur. If such an event matches  the mask in the Start register, this bit is cleared and counting  resumes.</description>
							<bitRange>[17:17]</bitRange>
							
						</field>
						<field>
							<name>HALT_H</name>
							<description>When this bit is 1, the H counter does not run and no events can occur.  This bit is set by reset. Once set, this bit can only be cleared by software to restore counter operation.</description>
							<bitRange>[18:18]</bitRange>
							
						</field>
						<field>
							<name>CLRCTR_H</name>
							<description>Writing a 1 to this bit clears the H counter. This bit always reads as 0.</description>
							<bitRange>[19:19]</bitRange>
							
						</field>
						<field>
							<name>BIDIR_H</name>
							<description>Direction select</description>
							<bitRange>[20:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>The H counter counts up to its limit condition, then is cleared to zero.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUNTDOWN</name>
									<description>The H counter counts up to its limit, then counts down to 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRE_H</name>
							<description>Specifies the factor by which the SCT clock is prescaled to produce the  H counter clock. The counter clock will be clocked at the rate of the SCT  clock divided by PRELH+1. Clear the counter (by writing a 1  to the CLRCTR bit) whenever changing the PRE value.</description>
							<bitRange>[28:21]</bitRange>
							
