pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
				<register>
					<name>CONFLAG</name>
					<description>SCT conflict flag register</description>
					<addressOffset>0x0FC</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>NCFLAG0</name>
							<description>Bit n is one if a no-change conflict event occurred on output n since  reset or a 1 was last written to this bit (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>NCFLAG1</name>
							<description>Bit n is one if a no-change conflict event occurred on output n since  reset or a 1 was last written to this bit (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>NCFLAG2</name>
							<description>Bit n is one if a no-change conflict event occurred on output n since  reset or a 1 was last written to this bit (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>NCFLAG3</name>
							<description>Bit n is one if a no-change conflict event occurred on output n since  reset or a 1 was last written to this bit (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>NCFLAG4</name>
							<description>Bit n is one if a no-change conflict event occurred on output n since  reset or a 1 was last written to this bit (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>NCFLAG5</name>
							<description>Bit n is one if a no-change conflict event occurred on output n since  reset or a 1 was last written to this bit (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>NCFLAG6</name>
							<description>Bit n is one if a no-change conflict event occurred on output n since  reset or a 1 was last written to this bit (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>NCFLAG7</name>
							<description>Bit n is one if a no-change conflict event occurred on output n since  reset or a 1 was last written to this bit (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>NCFLAG8</name>
							<description>Bit n is one if a no-change conflict event occurred on output n since  reset or a 1 was last written to this bit (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>NCFLAG9</name>
							<description>Bit n is one if a no-change conflict event occurred on output n since  reset or a 1 was last written to this bit (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>NCFLAG10</name>
							<description>Bit n is one if a no-change conflict event occurred on output n since  reset or a 1 was last written to this bit (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>NCFLAG11</name>
							<description>Bit n is one if a no-change conflict event occurred on output n since  reset or a 1 was last written to this bit (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>NCFLAG12</name>
							<description>Bit n is one if a no-change conflict event occurred on output n since  reset or a 1 was last written to this bit (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>NCFLAG13</name>
							<description>Bit n is one if a no-change conflict event occurred on output n since  reset or a 1 was last written to this bit (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>NCFLAG14</name>
							<description>Bit n is one if a no-change conflict event occurred on output n since  reset or a 1 was last written to this bit (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>NCFLAG15</name>
							<description>Bit n is one if a no-change conflict event occurred on output n since  reset or a 1 was last written to this bit (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[29:16]</bitRange>
						</field>
						<field>
							<name>BUSERRL</name>
							<description>The most recent bus error from this SCT involved writing CTR  L/Unified, STATE L/Unified, MATCH L/Unified, or the Output register when the  L/U counter was not halted. Note that a word write to certain L  and H registers can be half successful and half unsuccessful.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>BUSERRH</name>
							<description>The most recent bus error from this SCT involved writing CTR H,  STATE H, MATCH H, or the Output register when the H  counter was not halted.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>16</dim>
					<dimIncrement>0x04</dimIncrement>
					<dimIndex>0-15</dimIndex>
					<name>MATCH%s</name>
					<description>SCT match value register of match channel n; REGMODn = 0</description>
					<addressOffset>0x100</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MATCHn_L</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be  compared to the L counter. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<bitRange>[15:0]</bitRange>
						</field>

						<field>
							<name>MATCHn_H</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be  compared to the H counter. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>16</dim>
					<dimIncrement>0x04</dimIncrement>
					<dimIndex>0-15</dimIndex>
					<name>CAP%s</name>
					<description>SCT capture register of capture channel n; REGMODn = 1</description>
					<alternateRegister>MATCH%s</alternateRegister>
					<addressOffset>0x100</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAPn_L</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the lower 16 bits of the 32-bit value at which this register was last captured.</description>
							<bitRange>[15:0]</bitRange>
						</field>

						<field>
							<name>CAPn_H</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the upper 16 bits of the 32-bit value at which this register was last captured.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>16</dim>
					<dimIncrement>0x04</dimIncrement>
					<dimIndex>0-15</dimIndex>
					<name>MATCHREL%s</name>
					<description>SCT match reload value register ; REGMODn = 0</description>
					<addressOffset>0x200</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RELOADn_L</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be loaded into the SCTMATCHn_L register. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be loaded into the SCTMATCHn register.</description>
							<bitRange>[15:0]</bitRange>
						</field>

						<field>
							<name>RELOADn_H</name>
							<description>When UNIFY = 0, read or write the 16-bit to be loaded into the SCTMATCHn_H register. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be loaded into the SCTMATCHn register.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>16</dim>
					<dimIncrement>0x04</dimIncrement>
					<dimIndex>0-15</dimIndex>
					<name>CAPCTRL%s</name>
					<description>SCT capture control register ; REGMODn = 1</description>
					<alternateRegister>MATCHREL%s</alternateRegister>
					<addressOffset>0x200</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAPCONn_L0</name>
							<description>If bit m is one, event m causes the SCTCAPn_L (UNIFY = 0) or the SCTCAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CAPCONn_L1</name>
							<description>If bit m is one, event m causes the SCTCAPn_L (UNIFY = 0) or the SCTCAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>CAPCONn_L2</name>
							<description>If bit m is one, event m causes the SCTCAPn_L (UNIFY = 0) or the SCTCAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>CAPCONn_L3</name>
							<description>If bit m is one, event m causes the SCTCAPn_L (UNIFY = 0) or the SCTCAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>CAPCONn_L4</name>
							<description>If bit m is one, event m causes the SCTCAPn_L (UNIFY = 0) or the SCTCAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CAPCONn_L5</name>
							<description>If bit m is one, event m causes the SCTCAPn_L (UNIFY = 0) or the SCTCAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>CAPCONn_L6</name>
							<description>If bit m is one, event m causes the SCTCAPn_L (UNIFY = 0) or the SCTCAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>CAPCONn_L7</name>
							<description>If bit m is one, event m causes the SCTCAPn_L (UNIFY = 0) or the SCTCAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>CAPCONn_L8</name>
							<description>If bit m is one, event m causes the SCTCAPn_L (UNIFY = 0) or the SCTCAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>CAPCONn_L9</name>
							<description>If bit m is one, event m causes the SCTCAPn_L (UNIFY = 0) or the SCTCAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>CAPCONn_L10</name>
							<description>If bit m is one, event m causes the SCTCAPn_L (UNIFY = 0) or the SCTCAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>CAPCONn_L11</name>
							<description>If bit m is one, event m causes the SCTCAPn_L (UNIFY = 0) or the SCTCAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>CAPCONn_L12</name>
							<description>If bit m is one, event m causes the SCTCAPn_L (UNIFY = 0) or the SCTCAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>CAPCONn_L13</name>
							<description>If bit m is one, event m causes the SCTCAPn_L (UNIFY = 0) or the SCTCAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>CAPCONn_L14</name>
							<description>If bit m is one, event m causes the SCTCAPn_L (UNIFY = 0) or the SCTCAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>CAPCONn_L15</name>
							<description>If bit m is one, event m causes the SCTCAPn_L (UNIFY = 0) or the SCTCAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>CAPCONn_H</name>
							<description>If bit m is one, event m causes the SCTCAPn_H (UNIFY = 0) register to be loaded (event 0 = bit 16, event 1 = bit 17,..., event 15 = bit 31).</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
