pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
						</field>
						<field>
							<name>LLI</name>
							<description>Linked list item. Bits [31:2] of the address for the next LLI. Address bits [1:0] are 0.</description>
							<bitRange>[31:2]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x20</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>C%sCONTROL</name>
					<description>DMA Channel  Control Register</description>
					<addressOffset>0x10C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TRANSFERSIZE</name>
							<description>Transfer size in byte. A write to this field sets the size of the transfer when the DMA Controller is the flow controller. The transfer size value must be set before the channel is enabled. Transfer size is updated as data transfers are completed. A read from this field indicates the number of transfers completed on the destination bus. Reading the register when the channel is active does not give useful information because by the time that the software has processed the value read, the channel might have progressed. It is intended to be used only when a channel is enabled and then disabled. The transfer size value is not used if the DMA Controller is not the flow controller.</description>
							<bitRange>[11:0]</bitRange>
							
						</field>
						<field>
							<name>SBSIZE</name>
							<description>Source burst size. Indicates the number of transfers that make up a source burst. This value must be set to the burst size of the source peripheral, or if the source is memory, to the memory boundary size (see Figure 3). The burst size is the amount of data that is transferred when the BREQ signal goes active in the source peripheral.</description>
							<bitRange>[14:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SOURCE_BURST_1</name>
									<description>Source burst size = 1</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_BURST_4</name>
									<description>Source burst size = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_BURST_8</name>
									<description>Source burst size = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_BURST_16</name>
									<description>Source burst size = 16</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_BURST_32</name>
									<description>Source burst size = 32</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_BURST_64</name>
									<description>Source burst size = 64</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_BURST_128</name>
									<description>Source burst size = 128</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_BURST_256</name>
									<description>Source burst size = 256</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBSIZE</name>
							<description>Destination burst size. Indicates the number of transfers that make up a destination burst transfer request. This value must be set to the burst size of the destination peripheral or, if the destination is memory, to the memory boundary size. The burst size is the amount of data that is transferred when the BREQ signal goes active in the destination peripheral.</description>
							<bitRange>[17:15]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DESTINATION_BURST_1</name>
									<description>Destination burst size = 1</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_BURST_4</name>
									<description>Destination burst size = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_BURST_8</name>
									<description>Destination burst size = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_BURST_16</name>
									<description>Destination burst size = 16</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_BURST_32</name>
									<description>Destination burst size = 32</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_BURST_64</name>
									<description>Destination burst size = 64</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_BURST_128</name>
									<description>Destination burst size = 128</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_BURST_256</name>
									<description>Destination burst size = 256</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SWIDTH</name>
							<description>Source transfer width. Transfers wider than the AHB master bus width are illegal. The source and destination widths can be different from each other. The hardware automatically packs and unpacks the data as required. 0x3 to 0x7 - Reserved.</description>
							<bitRange>[20:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>BYTE_8_BIT</name>
									<description>Byte (8-bit)</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALFWORD_16_BIT</name>
									<description>Halfword (16-bit)</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WORD_32_BIT</name>
									<description>Word (32-bit)</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DWIDTH</name>
							<description>Destination transfer width. Transfers wider than the AHB master bus width are not supported. The source and destination widths can be different from each other. The hardware automatically packs and unpacks the data as required. 0x3 to 0x7 - Reserved.</description>
							<bitRange>[23:21]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>BYTE_8_BIT</name>
									<description>Byte (8-bit)</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALFWORD_16_BIT</name>
									<description>Halfword (16-bit)</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WORD_32_BIT</name>
									<description>Word (32-bit)</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S</name>
							<description>Source AHB master select:</description>
							<bitRange>[24:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>AHB_MASTER_0_SELECTE</name>
									<description>AHB Master 0 selected for source transfer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AHB_MASTER_1_SELECTE</name>
									<description>AHB Master 1 selected for source transfer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>D</name>
							<description>Destination AHB master select: Only Master1 can access a peripheral. Master0 can only access memory.</description>
							<bitRange>[25:25]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>AHB_MASTER_0_SELECTE</name>
									<description>AHB Master 0 selected for destination transfer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AHB_MASTER_1_SELECTE</name>
									<description>AHB Master 1 selected for destination transfer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SI</name>
							<description>Source increment:</description>
							<bitRange>[26:26]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOT_INCREMENT</name>
									<description>The source address is not incremented after each transfer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INCREMENT</name>
									<description>The source address is incremented after each transfer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DI</name>
							<description>Destination increment:</description>
							<bitRange>[27:27]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_DESTINATION_ADDR</name>
									<description>The destination address is not incremented after each transfer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_DESTINATION_ADDR</name>
									<description>The destination address is incremented after each transfer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PROT1</name>
							<description>Indicates that the access is in user mode or privileged mode:</description>
							<bitRange>[28:28]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ACCESS_IS_IN_USER_MO</name>
									<description>Access is in user mode</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACCESS_IS_IN_PRIVILE</name>
									<description>Access is in privileged mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PROT2</name>
							<description>Indicates that the access is bufferable or not bufferable:</description>
							<bitRange>[29:29]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ACCESS_IS_NOT_BUFFER</name>
									<description>Access is not bufferable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACCESS_IS_BUFFERABLE</name>
									<description>Access is bufferable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PROT3</name>
							<description>Indicates that the access is cacheable or not cacheable:</description>
							<bitRange>[30:30]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ACCESS_IS_NOT_CACHEA</name>
									<description>Access is not cacheable.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACCESS_IS_CACHEABLE_</name>
									<description>Access is cacheable.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I</name>
							<description>Terminal count interrupt enable bit.</description>
							<bitRange>[31:31]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_TERMINAL_COUNT_I</name>
									<description>The terminal count interrupt is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_TERMINAL_COUNT_I</name>
									<description>The terminal count interrupt is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x20</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>C%sCONFIG</name>
					<description>DMA Channel Configuration Register</description>
					<addressOffset>0x110</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>E</name>
							<description>Channel enable. Reading this bit indicates whether a channel is currently enabled or disabled: The Channel Enable bit status can also be found by reading the EnbldChns Register. A channel can be disabled by clearing the Enable bit. This causes the current AHB transfer (if one is in progress) to complete and the channel is then disabled. Any data in the FIFO of the relevant channel is lost. Restarting the channel by setting the Channel Enable bit has unpredictable effects, the channel must be fully re-initialized. The channel is also disabled, and Channel Enable bit cleared, when the last LLI is reached, the DMA transfer is completed, or if a channel error is encountered. If a channel must be disabled without losing data in the FIFO, the Halt bit must be set so that further DMA requests are ignored. The Active bit must then be polled until it reaches 0, indicating that there is no data left in the FIFO. Finally, the Channel Enable bit can be cleared.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CHANNEL_DISABLED_</name>
									<description>Channel disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANNEL_ENABLED_</name>
									<description>Channel enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRCPERIPHERAL</name>
							<description>Source peripheral. This value selects the DMA source request peripheral. This field is ignored if the source of the transfer is from memory. See Table 136 for details.</description>
							<bitRange>[5:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SOURCE_EQ_SPIFI</name>
									<description>Source = SPIFI</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_TIMER_0_MAT</name>
									<description>Source = Timer 0 match 0/UART0 transmit</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_TIMER_0_MAT</name>
									<description>Source = Timer 0 match 1/UART0 receive</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_TIMER_1_MAT</name>
									<description>Source = Timer 1 match 0/UART1 transmit</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_TIMER_1_MAT</name>
									<description>Source = Timer 1 match 1/UART 1 receive</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_TIMER_2_MAT</name>
									<description>Source = Timer 2 match 0/UART 2 transmit</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_TIMER_2_MAT</name>
									<description>Source = Timer 2 match 1/UART 2 receive</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_TIMER_3_MAT</name>
									<description>Source = Timer 3 match 0/UART3 transmit/SCT DMA request 0</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_TIMER_3_MAT</name>
									<description>Source = Timer 3 match 1/UART3 receive/SCT DMA request 1</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_SSP0_RECEIV</name>
									<description>Source = SSP0 receive/I2S channel 0</description>
									<value>0x9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_SSP0_TRANSM</name>
									<description>Source = SSP0 transmit/I2S channel 1</description>
									<value>0xA</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_SSP1_RECEIV</name>
									<description>Source = SSP1 receive</description>
									<value>0xB</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_SSP1_TRANSM</name>
									<description>Source = SSP1 transmit</description>
									<value>0xC</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_ADC0</name>
									<description>Source = ADC0</description>
									<value>0xD</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_ADC1</name>
									<description>Source = ADC1</description>
									<value>0xE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_DAC</name>
									<description>Source = DAC</description>
									<value>0xF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DESTPERIPHERAL</name>
							<description>Destination peripheral. This value selects the DMA destination request peripheral. This field is ignored if the destination of the transfer is to memory. See Table 136 for details.</description>
							<bitRange>[10:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DESTINATION_EQ_SPIFI</name>
									<description>Destination = SPIFI</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_TIMER_</name>
									<description>Destination = Timer 0 match 0/UART0 transmit</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_TIMER_</name>
									<description>Destination = Timer 0 match 1/UART0 receive</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_TIMER_</name>
									<description>Destination = Timer 1 match 0/UART1 transmit</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_TIMER_</name>
									<description>Destination = Timer 1 match 1/UART 1 receive</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_TIMER_</name>
									<description>Destination = Timer 2 match 0/UART 2 transmit</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_TIMER_</name>
									<description>Destination = Timer 2 match 1/UART 2 receive</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_TIMER_</name>
									<description>Destination = Timer 3 match 0/UART3 transmit/SCT DMA request 0</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_TIMER_</name>
									<description>Destination = Timer 3 match 1/UART3 receive/SCT DMA request 1</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_SSP0_R</name>
									<description>Destination = SSP0 receive/I2S channel 0</description>
									<value>0x9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_SSP0_T</name>
									<description>Destination = SSP0 transmit/I2S channel 1</description>
									<value>0xA</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_SSP1_R</name>
									<description>Destination = SSP1 receive</description>
									<value>0xB</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_SSP1_T</name>
									<description>Destination = SSP1 transmit</description>
									<value>0xC</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_ADC0</name>
									<description>Destination = ADC0</description>
									<value>0xD</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_ADC1</name>
									<description>Destination = ADC1</description>
									<value>0xE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_DAC</name>
									<description>Destination = DAC</description>
									<value>0xF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FLOWCNTRL</name>
							<description>Flow control and transfer type. This value indicates the flow controller and transfer type. The flow controller can be the DMA Controller, the source peripheral, or the destination peripheral. The transfer type can be memory-to-memory, memory-to-peripheral, peripheral-to-memory, or peripheral-to-peripheral. Refer to Table 157 for the encoding of this field.</description>
							<bitRange>[13:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MEMORY_TO_MEMORY_(DM</name>
									<description>Memory to memory (DMA control)</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MEMORY_TO_PERIPHERAL</name>
									<description>Memory to peripheral (DMA control)</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PERIPHERAL_TO_MEMORY</name>
									<description>Peripheral to memory (DMA control)</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_PERIPHERAL_TO</name>
									<description>Source peripheral to destination peripheral (DMA control)</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_PERIPHERAL_TO</name>
									<description>Source peripheral to destination peripheral (destination control)</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MEMORY_TO_PERIPHERAL</name>
									<description>Memory to peripheral (peripheral control)</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PERIPHERAL_TO_MEMORY</name>
									<description>Peripheral to memory (peripheral control)</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_PERIPHERAL_TO</name>
									<description>Source peripheral to destination peripheral (source control)</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IE</name>
							<description>Interrupt error mask. When cleared, this bit masks out the error interrupt of the relevant channel.</description>
							<bitRange>[14:14]</bitRange>
							
