pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
						</field>
						<field>
							<name>ITC</name>
							<description>Terminal count interrupt mask. When cleared, this bit masks out the terminal count interrupt of the relevant channel.</description>
							<bitRange>[15:15]</bitRange>
							
						</field>
						<field>
							<name>L</name>
							<description>Lock. When set, this bit enables locked transfers.</description>
							<bitRange>[16:16]</bitRange>
							
						</field>
						<field>
							<name>A</name>
							<description>Active: 0 = there is no data in the FIFO of the channel. 1 = the channel FIFO has data. This value can be used with the Halt and Channel Enable bits to cleanly disable a DMA channel. This is a read-only bit.</description>
							<bitRange>[17:17]</bitRange>
							
						</field>
						<field>
							<name>H</name>
							<description>Halt: 0 = enable DMA requests. 1 = ignore further source DMA requests. The contents of the channel FIFO are drained. This value can be used with the Active and Channel Enable bits to cleanly disable a DMA channel.</description>
							<bitRange>[18:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE_DMA_REQUESTS_</name>
									<description>Enable DMA requests.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IGNORE_FURTHER_SOURC</name>
									<description>Ignore further source DMA requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, do not modify, masked on read.</description>
							<bitRange>[31:19]</bitRange>
							
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>


		<peripheral>
			<name>SDMMC</name>
			<description>Product name title=UM10430 Chapter title=LPC18xx SD/MMC Modification date=n/a Major revision=n/a Minor revision=n/a </description>
			<groupName>SDMMC</groupName>
			<baseAddress>0x40004000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SDIO</name>
				<value>6</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>Control Register</description>
					<addressOffset>0x00</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CONTROLLER_RESET</name>
							<description>Controller reset. To reset controller, firmware should set bit to 1. This bit is auto-cleared
after two AHB and two cclk_in clock cycles.
This resets:
* BIU/CIU interface
* CIU and state machines
* abort_read_data, send_irq_response, and read_wait bits of
Control register
* start_cmd bit of Command register
Does not affect any registers or DMA interface, or FIFO or host
interrupts</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOCHANGE</name>
									<description>No change</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset DWC_mobile_storage controller</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FIFO_RESET</name>
							<description>fifo_reset. To reset FIFO, firmware should set bit to 1. This bit is auto-cleared after
completion of reset operation.
auto-cleared after two AHB clocks.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOCHANGE</name>
									<description>No change</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset to data FIFO To reset FIFO pointers</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMA_RESET</name>
							<description>dma_reset. To reset DMA interface, firmware should set bit to 1. This bit is
auto-cleared after two AHB clocks.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOCHANGE</name>
									<description>No change</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset internal DMA interface control logic</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[3:3]</bitRange>
							
						</field>
						<field>
							<name>INT_ENABLE</name>
							<description>Global interrupt enable/disable bit. The int port is 1 only when this bit is 1 and one or more unmasked
interrupts are set.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable interrupts</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable interrupts</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMA_ENABLE</name>
							<description>dma_enable. Valid only if DWC_mobile_storage configured for External DMA
interface.
Even when DMA mode is enabled, host can still push/pop data into or
from FIFO; this should not happen during the normal operation. If there
is simultaneous FIFO access from host/DMA, the data coherency is
lost. Also, there is no arbitration inside DWC_mobile_storage to
prioritize simultaneous host/DMA access.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable DMA transfer mode</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable DMA transfer mode</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>READ_WAIT</name>
							<description>read_wait. For sending read-wait to SDIO cards.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear read wait</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ASSERT</name>
									<description>Assert read wait</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEND_IRQ_RESPONSE</name>
							<description>send_irq_response. Bit automatically clears once response is sent.
To wait for MMC card interrupts, host issues CMD40, and
DWC_mobile_storage waits for interrupt response from MMC card(s). In
meantime, if host wants DWC_mobile_storage to exit waiting for
interrupt state, it can set this bit, at which time DWC_mobile_storage
command state-machine sends CMD40 response on bus and returns to
idle state.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOCHANGE</name>
									<description>No change</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SENDRESPONSE</name>
									<description>Send auto IRQ response</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ABORT_READ_DATA</name>
							<description>abort_read_data. Used in SDIO card suspend sequence.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOCHANGE</name>
									<description>No change</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POLL</name>
									<description>After suspend command is issued during read-transfer, software
polls card to find when suspend happened. Once suspend occurs,
software sets bit to reset data state-machine, which is waiting for
next block of data. Bit automatically clears once data statemachine
resets to idle.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEND_CCSD</name>
							<description>send_ccsd. When set, DWC_mobile_storage sends CCSD to CE-ATA device.
Software sets this bit only if current command is expecting CCS (that is,
RW_BLK) and interrupts are enabled in CE-ATA device.
Once the CCSD pattern is sent to device, DWC_mobile_storage
automatically clears send_ccsd bit. It also sets Command Done (CD) bit
in RINTSTS register and generates interrupt to host if Command Done
interrupt is not masked.
NOTE: Once send_ccsd bit is set, it takes two card clock cycles to drive
the CCSD on the CMD line. Due to this, during the boundary conditions
it may happen that CCSD is sent to the CE-ATA device, even if the
device signalled CCS.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear bit if DWC_mobile_storage does not reset the bit.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SEND</name>
									<description>Send Command Completion Signal Disable (CCSD) to CE-ATA
device</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEND_AUTO_STOP_CCSD</name>
							<description>send_auto_stop_ccsd. NOTE: Always set send_auto_stop_ccsd and send_ccsd bits together;
send_auto_stop_ccsd should not be set independent of send_ccsd.
When set, DWC_Mobile_Storage automatically sends internallygenerated
STOP command (CMD12) to CE-ATA device. After sending
internally-generated STOP command, Auto Command Done (ACD) bit
in RINTSTS is set and generates interrupt to host if Auto Command
Done interrupt is not masked. After sending the CCSD,
DWC_mobile_storage automatically clears send_auto_stop_ccsd bit.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear bit if DWC_mobile_storage does not reset the bit.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SEND</name>
									<description>Send internally generated STOP after sending CCSD to CE-ATA
device.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CEATA_DEVICE_INTERRUPT_STATUS</name>
							<description>ceata_device_interrupt
_status. Software should appropriately write to this bit after power-on reset or
any other reset to CE-ATA device. After reset, usually CE-ATA device
interrupt is disabled (nIEN = 1). If the host enables CE-ATA device
interrupt, then software should set this bit.</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Interrupts not enabled in CE-ATA device (nIEN = 1 in ATA
control register)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Interrupts are enabled in CE-ATA device (nIEN = 0 in ATA
control register)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[15:12]</bitRange>
							
