pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
						</field>
						<field>
							<name>DP</name>
							<description>Low-power SDRAM deep-sleep mode.</description>
							<bitRange>[13:13]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL_OPERATION_(PO</name>
									<description>Normal operation (POR reset value).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENTER_DEEP_SLEEP_MOD</name>
									<description>Enter Deep-sleep mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:14]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>DYNAMICREFRESH</name>
					<description>Configures dynamic memory refresh operation.</description>
					<addressOffset>0x024</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REFRESH</name>
							<description>Refresh timer. Indicates the multiple of 16 CCLKs between SDRAM refresh cycles. 0x0 = Refresh disabled (POR reset value). 0x1 - 0x7FF = n x16 = 16n CCLKs between SDRAM refresh cycles. For example: 0x1 = 1 x 16 = 16 CCLKs between SDRAM refresh cycles. 0x8 = 8 x 16 = 128 CCLKs between SDRAM refresh cycles</description>
							<bitRange>[10:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DYNAMICREADCONFIG</name>
					<description>Configures the dynamic memory read strategy.</description>
					<addressOffset>0x028</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RD</name>
							<description>Read data strategy.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CLOCK_OUT_DELAYED_ST</name>
									<description>Clock out delayed strategy, using CLKOUT (command not delayed, clock out delayed). POR reset value.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COMMAND_DELAYED</name>
									<description>Command delayed strategy, using CCLKDELAY (command delayed, clock out not delayed).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COMMAND_DELAYED_PLUS1</name>
									<description>Command delayed strategy plus one clock cycle, using CCLKDELAY (command delayed, clock out not delayed).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COMMAND_DELAYED_PLUS2</name>
									<description>Command delayed strategy plus two clock cycles, using CCLKDELAY (command delayed, clock out not delayed).</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:2]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>DYNAMICRP</name>
					<description>Selects the precharge command period.</description>
					<addressOffset>0x030</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000000F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>tRP</name>
							<description>Precharge command period. 0x0 - 0xE = n + 1 clock cycles. The delay is in CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DYNAMICRAS</name>
					<description>Selects the active to precharge command period.</description>
					<addressOffset>0x034</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000000F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>tRAS</name>
							<description>Active to precharge command period. 0x0 - 0xE = n + 1 clock cycles. The delay is in CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DYNAMICSREX</name>
					<description>Selects the self-refresh exit time.</description>
					<addressOffset>0x038</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000000F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>tSREX</name>
							<description>Self-refresh exit time . 0x0 - 0xE = n + 1 clock cycles. The delay is in CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DYNAMICAPR</name>
					<description>Selects the last-data-out to active command time.</description>
					<addressOffset>0x03C</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000000F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>tAPR</name>
							<description>Last-data-out to active command time. 0x0 - 0xE = n + 1 clock cycles. The delay is in CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DYNAMICDAL</name>
					<description>Selects the data-in to active command time.</description>
					<addressOffset>0x040</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000000F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>tDAL</name>
							<description>Data-in to active command. 0x0 - 0xE = n clock cycles. The delay is in CCLK cycles. 0xF = 15 clock cycles (POR reset value).</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DYNAMICWR</name>
					<description>Selects the write recovery time.</description>
					<addressOffset>0x044</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000000F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>tWR</name>
							<description>Write recovery time. 0x0 - 0xE = n + 1 clock cycles. The delay is in CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DYNAMICRC</name>
					<description>Selects the active to active command period.</description>
					<addressOffset>0x048</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000001F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>tRC</name>
							<description>Active to active command period. 0x0 - 0x1E = n + 1 clock cycles. The delay is in CCLK cycles. 0x1F = 32 clock cycles (POR reset value).</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DYNAMICRFC</name>
					<description>Selects the auto-refresh period.</description>
					<addressOffset>0x04C</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000001F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>tRFC</name>
							<description>Auto-refresh period and auto-refresh to active command period. 0x0 - 0x1E = n + 1 clock cycles. The delay is in CCLK cycles. 0x1F = 32 clock cycles (POR reset value).</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DYNAMICXSR</name>
					<description>Selects the exit self-refresh to active command time.</description>
					<addressOffset>0x050</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000001F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>tXSR</name>
							<description>Exit self-refresh to active command time. 0x0 - 0x1E = n + 1 clock cycles. The delay is in CCLK cycles. 0x1F = 32 clock cycles (POR reset value).</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DYNAMICRRD</name>
					<description>Selects the active bank A to active bank B latency.</description>
					<addressOffset>0x054</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000000F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>tRRD</name>
							<description>Active bank A to active bank B latency 0x0 - 0xE = n + 1 clock cycles. The delay is in CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DYNAMICMRD</name>
					<description>Selects the load mode register to active command time.</description>
					<addressOffset>0x058</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000000F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>tMRD</name>
							<description>Load mode register to active command time. 0x0 - 0xE = n + 1 clock cycles. The delay is in CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STATICEXTENDEDWAIT</name>
					<description>Selects time for long static memory read and write transfers.</description>
					<addressOffset>0x080</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EXTENDEDWAIT</name>
							<description>Extended wait time out. 16 clock cycles (POR reset value). The delay is in CCLK cycles. 0x0 = 16 clock cycles. 0x1 - 0x3FF = (n+1) x16 clock cycles.</description>
							<bitRange>[9:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x20</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>DYNAMICCONFIG%s</name>
					<description>Selects the configuration information for dynamic memory chip select n.</description>
					<addressOffset>0x100</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[2:0]</bitRange>
							
