pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
						</field>
					</fields>
				</register>
				<register>
					<name>USBINTR_D</name>
					<description>USB interrupt enable (device mode)</description>
					<addressOffset>0x148</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>UE</name>
							<description>USB interrupt enable When this bit is one, and the USBINT bit in the USBSTS register is one, the host/device controller will issue an interrupt at the next interrupt threshold. The interrupt is acknowledged by software clearing the USBINT bit in USBSTS.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>UEE</name>
							<description>USB error interrupt enable When this bit is a one, and the USBERRINT bit in the USBSTS register is a one, the host/device controller will issue an interrupt at the next interrupt threshold. The interrupt is acknowledged by software clearing the USBERRINT bit in the USBSTS register.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>PCE</name>
							<description>Port change detect enable When this bit is a one, and the Port Change Detect bit in the USBSTS register is a one, the host/device controller will issue an interrupt. The interrupt is acknowledged by software clearing the Port Change Detect bit in USBSTS.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used by the Device controller.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used by the Device controller.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>URE</name>
							<description>USB reset enable When this bit is a one, and the USB Reset Received bit in the USBSTS register is a one, the device controller will issue an interrupt. The interrupt is acknowledged by software clearing the USB Reset Received bit.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>SRE</name>
							<description>SOF received enable When this bit is a one, and the SOF Received bit in the USBSTS register is a one, the device controller will issue an interrupt. The interrupt is acknowledged by software clearing the SOF Received bit.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>SLE</name>
							<description>Sleep enable When this bit is a one, and the DCSuspend bit in the USBSTS register transitions, the device controller will issue an interrupt. The interrupt is acknowledged by software writing a one to the DCSuspend bit.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[15:9]</bitRange>
						</field>
						<field>
							<name>NAKE</name>
							<description>NAK interrupt enable This bit is set by software if it wants to enable the hardware interrupt for the NAK Interrupt bit. If both this bit and the corresponding NAK Interrupt bit are set, a hardware interrupt is generated.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>UAIE</name>
							<description>Not used by the Device controller.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>UPIA</name>
							<description>Not used by the Device controller.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:20]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>USBINTR_H</name>
					<description>USB interrupt enable (host mode)</description>
					<alternateRegister>USBINTR_D</alternateRegister>
					<addressOffset>0x148</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>UE</name>
							<description>USB interrupt enable When this bit is one, and the USBINT bit in the USBSTS register is one, the host/device controller will issue an interrupt at the next interrupt threshold. The interrupt is acknowledged by software clearing the USBINT bit in USBSTS.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>UEE</name>
							<description>USB error interrupt enable When this bit is a one, and the USBERRINT bit in the USBSTS register is a one, the host/device controller will issue an interrupt at the next interrupt threshold. The interrupt is acknowledged by software clearing the USBERRINT bit in the USBSTS register.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>PCE</name>
							<description>Port change detect enable When this bit is a one, and the Port Change Detect bit in the USBSTS register is a one, the host/device controller will issue an interrupt. The interrupt is acknowledged by software clearing the Port Change Detect bit in USBSTS.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>FRE</name>
							<description>Frame list rollover enable When this bit is a one, and the Frame List Rollover bit in the USBSTS register is a one, the host controller will issue an interrupt. The interrupt is acknowledged by software clearing the Frame List Rollover bit.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>AAE</name>
							<description>Interrupt on asynchronous advance enable When this bit is a one, and the Interrupt on Async Advance bit in the USBSTS register is a one, the host controller will issue an interrupt at the next interrupt threshold. The interrupt is acknowledged by software clearing the Interrupt on Async Advance bit.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used by the Host controller.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>SRE</name>
							<description>If this bit is one and the SRI bit in the USBSTS register is one, the host controller will issue an interrupt. In host mode, the SRI bit will be set every 125 ms and can be used by the host controller as a time base. The interrupt is acknowledged by software clearing the SRI bit in the USBSTS register.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used by the Host controller.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[15:9]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used by the host controller.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>UAIE</name>
							<description>USB host asynchronous interrupt enable When this bit is a one, and the USBHSTASYNCINT bit in the USBSTS register is a one, the host controller will issue an interrupt at the next interrupt threshold. The interrupt is acknowledged by software clearing the USBHSTASYNCINT bit.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>UPIA</name>
							<description>USB host periodic interrupt enable When this bit is a one, and the USBHSTPERINT bit in the USBSTS register is a one, the host controller will issue an interrupt at the next interrupt threshold. The interrupt is acknowledged by software clearing the USBHSTPERINT bit.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:20]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FRINDEX_D</name>
					<description>USB frame index (device mode)</description>
					<addressOffset>0x14C</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FRINDEX2_0</name>
							<description>Current micro frame number</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>FRINDEX13_3</name>
							<description>Current frame number of the last frame transmitted</description>
							<bitRange>[13:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:14]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FRINDEX_H</name>
					<description>USB frame index (host mode)</description>
					<alternateRegister>FRINDEX_D</alternateRegister>
					<addressOffset>0x14C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FRINDEX2_0</name>
							<description>Current micro frame number</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>FRINDEX12_3</name>
							<description>Frame list current index for 1024 elements.</description>
							<bitRange>[12:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:13]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVICEADDR</name>
					<description>USB device address</description>
					<addressOffset>0x154</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[23:0]</bitRange>
							
