pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
						</field>
						<field>
							<name>USBADRA</name>
							<description>Device address advance</description>
							<bitRange>[24:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ADVANCE</name>
									<description>Any write to USBADR are instantaneous.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HOLD</name>
									<description>When the user writes a one to this bit at the same time or before USBADR is written, the write to USBADR fields is staged and held in a hidden register. After an IN occurs on endpoint 0 and is acknowledged, USBADR will be loaded from the holding register. Hardware will automatically clear this bit on the following conditions: IN is ACKed to endpoint 0. USBADR is updated from the staging register. OUT/SETUP occurs on endpoint 0. USBADR is not updated. Device reset occurs. USBADR is set to 0. After the status phase of the SET_ADDRESS descriptor, the DCD has 2 ms to program the USBADR field. This mechanism will ensure this specification is met when the DCD can not write the device address within 2 ms from the SET_ADDRESS status phase. If the DCD writes the USBADR with USBADRA=1 after the SET_ADDRESS data phase (before the prime of the status phase), the USBADR will be programmed instantly at the correct time and meet the 2 ms USB requirement.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USBADR</name>
							<description>USB device address</description>
							<bitRange>[31:25]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>PERIODICLISTBASE</name>
					<description>Frame list base address</description>
					<alternateRegister>DEVICEADDR</alternateRegister>
					<addressOffset>0x154</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[11:0]</bitRange>
						</field>
						<field>
							<name>PERBASE31_12</name>
							<description>Base Address (Low) These bits correspond to the memory address signals[31:12].</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ENDPOINTLISTADDR</name>
					<description>Address of endpoint list in memory (device mode)</description>
					<addressOffset>0x158</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[10:0]</bitRange>
						</field>
						<field>
							<name>EPBASE31_11</name>
							<description>Endpoint list pointer (low) These bits correspond to memory address signals 31:11, respectively. This field will reference a list of up to 4 Queue Heads (QH). (i.e. one queue head per endpoint and direction.)</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ASYNCLISTADDR</name>
					<description>Address of endpoint list in memory (host mode)</description>
					<alternateRegister>ENDPOINTLISTADDR</alternateRegister>
					<addressOffset>0x158</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>ASYBASE31_5</name>
							<description>Link pointer (Low) LPL These bits correspond to memory address signals 31:5, respectively. This field may only reference a Queue Head (OH).</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TTCTRL</name>
					<description>Asynchronous buffer status for embedded TT (host mode)</description>
					<addressOffset>0x15C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[23:0]</bitRange>
						</field>
						<field>
							<name>TTHA</name>
							<description>Hub address when FS or LS device are connected directly.</description>
							<bitRange>[30:24]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>BURSTSIZE</name>
					<description>Programmable burst size</description>
					<addressOffset>0x160</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXPBURST</name>
							<description>Programmable RX burst length This register represents the maximum length of a burst in 32-bit words while moving data from the USB bus to system memory.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>TXPBURST</name>
							<description>Programmable TX burst length This register represents the maximum length of a burst in 32-bit words while moving data from system memory to the USB bus.</description>
							<bitRange>[15:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TXFILLTUNING</name>
					<description>Host transmit pre-buffer packet tuning (host mode)</description>
					<addressOffset>0x164</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXSCHOH</name>
							<description>FIFO burst threshold This register controls the number of data bursts that are posted to the TX latency FIFO in host mode before the packet begins on to the bus. The minimum value is 2 and this value should be a low as possible to maximize USB performance. A higher value can be used in systems with unpredictable latency and/or insufficient bandwidth where the FIFO may underrun because the data transferred from the latency FIFO to USB occurs before it can be replenished from system memory. This value is ignored if the Stream Disable bit in USBMODE register is set.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>TXSCHEATLTH</name>
							<description>Scheduler health counter This register increments when the host controller fails to fill the TX latency FIFO to the level programmed by TXFIFOTHRES before running out of time to send the packet before the next Start-Of-Frame . This health counter measures the number of times this occurs to provide feedback to selecting a proper TXSCHOH. Writing to this register will clear the counter. The maximum value is 31.</description>
							<bitRange>[12:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[15:13]</bitRange>
						</field>
						<field>
							<name>TXFIFOTHRES</name>
							<description>Scheduler overhead This register adds an additional fixed offset to the schedule time estimator described above as Tff. As an approximation, the value chosen for this register should limit the number of back-off events captured in the TXSCHHEALTH to less than 10 per second in a highly utilized bus. Choosing a value that is too high for this register is not desired as it can needlessly reduce USB utilization. The time unit represented in this register is 1.267  ms when a device is connected in High-Speed Mode. The time unit represented in this register is 6.333  ms when a device is connected in Low/Full Speed Mode.</description>
							<bitRange>[21:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ULPIVIEWPORT</name>
					<description>ULPI viewport</description>
					<addressOffset>0x170</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ULPIDATWR</name>
							<description>When a write operation is commanded, the  data to be sent is written to this field.</description>
							<bitRange>[7:0]</bitRange>
							
