pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
						</field>
						<field>
							<name>ULPIDATRD</name>
							<description>After a read operation completes, the result is  placed in this field.</description>
							<bitRange>[15:8]</bitRange>
							
						</field>
						<field>
							<name>ULPIADDR</name>
							<description>When a read or write operation is  commanded, the address of the operation is written to this field.</description>
							<bitRange>[23:16]</bitRange>
							
						</field>
						<field>
							<name>ULPIPORT</name>
							<description>For the wakeup or read/write operation to  be executed, this value must be written as 0.</description>
							<bitRange>[26:24]</bitRange>
							
						</field>
						<field>
							<name>ULPISS</name>
							<description>ULPI sync state. This bit represents the state of the ULPI  interface.</description>
							<bitRange>[27:27]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>IN_ANOTHER_STATE_(I</name>
									<description>In another state  (ie. carkit, serial, low power)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NORMAL_SYNC_STATE_</name>
									<description>Normal Sync. State.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[28:28]</bitRange>
							
						</field>
						<field>
							<name>ULPIRW</name>
							<description>ULPI Read/Write control. This bit selects between running a read or write operation.</description>
							<bitRange>[29:29]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>READ</name>
									<description>Read</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WRITE</name>
									<description>Write</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ULPIRUN</name>
							<description>ULPI Read/Write Run. Writing the 1 to this bit will begin the  read/write operation. The bit will automatically transition to 0 after the  read/write is complete. Once this bit is set, the driver can not set it back to 0. The driver must never executue a wakeup and a read/write operation at  the same time.</description>
							<bitRange>[30:30]</bitRange>
							
						</field>
						<field>
							<name>ULPIWU</name>
							<description>ULPI Wake-up.  Writing the 1 to this bit will begin the wakeup  operation. The bit will automatically transition to 0 after the wakeup is  complete. Once this bit is set, the driver can not set it back to 0. The driver must never executue a wakeup and a read/write operation at  the same time.</description>
							<bitRange>[31:31]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>BINTERVAL</name>
					<description>Length of virtual frame</description>
					<addressOffset>0x174</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BINT</name>
							<description>bInterval value</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ENDPTNAK</name>
					<description>Endpoint NAK (device mode)</description>
					<addressOffset>0x178</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EPRN0</name>
							<description>Rx endpoint NAK Each RX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received OUT or PING token for the corresponding endpoint. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EPRN1</name>
							<description>Rx endpoint NAK Each RX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received OUT or PING token for the corresponding endpoint. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EPRN2</name>
							<description>Rx endpoint NAK Each RX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received OUT or PING token for the corresponding endpoint. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>EPRN3</name>
							<description>Rx endpoint NAK Each RX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received OUT or PING token for the corresponding endpoint. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[15:4]</bitRange>
						</field>
						<field>
							<name>EPTN16</name>
							<description>Tx endpoint NAK Each TX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received IN token for the corresponding endpoint. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>EPTN17</name>
							<description>Tx endpoint NAK Each TX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received IN token for the corresponding endpoint. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>EPTN18</name>
							<description>Tx endpoint NAK Each TX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received IN token for the corresponding endpoint. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>EPTN19</name>
							<description>Tx endpoint NAK Each TX endpoint has one bit in this field. The bit is set when the device sends a NAK handshake on a received IN token for the corresponding endpoint. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:20]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ENDPTNAKEN</name>
					<description>Endpoint NAK Enable (device mode)</description>
					<addressOffset>0x17C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EPRNE0</name>
							<description>Rx endpoint NAK enable Each bit enables the corresponding RX NAK bit. If this bit is set and the corresponding RX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EPRNE1</name>
							<description>Rx endpoint NAK enable Each bit enables the corresponding RX NAK bit. If this bit is set and the corresponding RX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EPRNE2</name>
							<description>Rx endpoint NAK enable Each bit enables the corresponding RX NAK bit. If this bit is set and the corresponding RX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>EPRNE3</name>
							<description>Rx endpoint NAK enable Each bit enables the corresponding RX NAK bit. If this bit is set and the corresponding RX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[15:4]</bitRange>
						</field>
						<field>
							<name>EPTNE16</name>
							<description>Tx endpoint NAK Each bit enables the corresponding TX NAK bit. If this bit is set and the corresponding TX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>EPTNE17</name>
							<description>Tx endpoint NAK Each bit enables the corresponding TX NAK bit. If this bit is set and the corresponding TX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>EPTNE18</name>
							<description>Tx endpoint NAK Each bit enables the corresponding TX NAK bit. If this bit is set and the corresponding TX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>EPTNE19</name>
							<description>Tx endpoint NAK Each bit enables the corresponding TX NAK bit. If this bit is set and the corresponding TX endpoint NAK bit is set, the NAK interrupt bit is set. Bit 3 corresponds to endpoint 3. ... Bit 1 corresponds to endpoint 1. Bit 0 corresponds to endpoint 0.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:20]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PORTSC1_D</name>
					<description>Port 1 status/control (device mode)</description>
					<addressOffset>0x184</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CCS</name>
							<description>Current connect status</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DEVICE_NOT_ATTACHED_</name>
									<description>Device not attached A zero indicates that the device did not attach successfully or was forcibly disconnected by the software writing a zero to the Run bit in the USBCMD register. It does not state the device being disconnected or suspended.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEVICE_ATTACHED__A_</name>
									<description>Device attached.  A one indicates that the device successfully attached and is operating in either high-speed mode or full-speed mode as indicated by the High Speed Port bit in this register.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSC</name>
							<description>Not used in device mode</description>
							<bitRange>[1:1]</bitRange>
							
