pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
		<register>
			<name>SUBSECOND_INCR</name>
			<description>Sub-second increment register</description>
			<addressOffset>0x0704</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SSINC</name>
					<description>Sub-second increment value. The value programmed in this register is accumulated with the contents of the sub-second register. For example, to achieve an accuracy of 20 ns, the value to be programmed is 20. (0x14 with a 50 MHz reference clock if 1 ns accuracy is selected.)</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SECONDS</name>
			<description>System time seconds register</description>
			<addressOffset>0x0708</addressOffset>
			<access>read-only</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TSS</name>
					<description>Time stamp second The value in this field indicates the current value in seconds of the System Time maintained by the core.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>NANOSECONDS</name>
			<description>System time nanoseconds register</description>
			<addressOffset>0x070C</addressOffset>
			<access>read-only</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TSSS</name>
					<description>Time stamp sub seconds The value in this field has the sub second representation of time, with an accuracy of 0.46 nano-second. (When TSCTRLSSR in the MAC_TIMESTAMP_CTRL register is set, each bit represents 1 ns and the maximum value will be 0x3B9A_C9FF, after which it rolls-over to zero).</description>
					<bitRange>[30:0]</bitRange>
				</field>
				<field>
					<name>PSNT</name>
					<description>Positive or negative time This bit indicates positive or negative time value. If the bit is reset, it indicates that the time representation is positive, and if it is set, it indicates negative time value. (This bit represents the 32nd bit of the nanoseconds value when the Advance Time Stamp feature is enabled).</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SECONDSUPDATE</name>
			<description>System time seconds update register</description>
			<addressOffset>0x0710</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TSS</name>
					<description>Time stamp second The value in this field indicates the time, in seconds, to be initialized or added to the system time.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>NANOSECONDSUPDATE</name>
			<description>System time nanoseconds update register</description>
			<addressOffset>0x0714</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TSSS</name>
					<description>Time stamp sub seconds The value in this field has the sub second representation of time, with an accuracy of 0.46 nano-second. (When TSCTRLSSR is set in the time stamp control register, each bit represents 1 ns and the programmed value should not exceed 0x3B9A_C9FF.)</description>
					<bitRange>[30:0]</bitRange>
				</field>
				<field>
					<name>ADDSUB</name>
					<description>Add or subtract time When this bit is set, the time value is subtracted with the contents of the update register. When this bit is reset, the time value is added with the contents of the update register.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>ADDEND</name>
			<description>Time stamp addend register</description>
			<addressOffset>0x0718</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TSAR</name>
					<description>Time stamp addend This register indicates the 32-bit time value to be added to the Accumulator register to achieve time synchronization.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TARGETSECONDS</name>
			<description>Target time seconds register</description>
			<addressOffset>0x071C</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TSTR</name>
					<description>Target time seconds register This register stores the time in seconds. When the time stamp value matches or exceeds both Target Time Stamp registers, the MAC, if enabled, generates an interrupt.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TARGETNANOSECONDS</name>
			<description>Target time nanoseconds register</description>
			<addressOffset>0x0720</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TSTR</name>
					<description>Target time stamp low  This register stores the time in (signed) nanoseconds. When the value of the Time Stamp matches the Target time stamp registers (both), the MAC will generate an interrupt if enabled. (This value should not exceed 0x3B9A_C9FF when TSCTRLSSR is set in the time stamp control register.)</description>
					<bitRange>[30:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>HIGHWORD</name>
			<description>System time higher word seconds register</description>
			<addressOffset>0x0724</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TSHWR</name>
					<description>Time stamp higher word Contains the most significant 16-bits of the time stamp seconds value. The register is directly written to initialize the value. This register is incremented when there is an overflow from the 32-bits of the System Time - Seconds register.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TIMESTAMPSTAT</name>
			<description>Time stamp status register</description>
			<addressOffset>0x0728</addressOffset>
			<access>read-only</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TSSOVF</name>
					<description>Time stamp seconds overflow When set, indicates that the seconds value of the time stamp (when supporting version 2 format) has overflowed beyond 0xFFFF_FFFF.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>TSTARGT</name>
					<description>Time stamp target reached When set, indicates the value of system time is greater or equal to the value specified in the Target Time High and Low registers</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>AUXSS</name>
					<description>Auxiliary Time Stamp Trigger Snapshot  This bit is set high when the auxiliary snapshot is written to the FIFO.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[23:3]</bitRange>
				</field>
				<field>
					<name>ATSSTM</name>
					<description>Auxiliary Time Stamp Snapshot Trigger Missed  This bit is set when the Auxiliary time stamp snapshot FIFO is full and external trigger was set. This indicates that the latest snapshot was not stored in the FIFO.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>ATSNS</name>
					<description>Auxiliary Time Stamp Number of Snapshots  These bits indicate the number of Snapshots available in the FIFO. A value of 4 (100) indicates that the Auxiliary Snapshot FIFO is full. These bits are cleared (to 000) when the Auxiliary snapshot FIFO clear bit is set.</description>
					<bitRange>[27:25]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:28]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PPSCTRL</name>
			<description>PPS control register</description>
			<addressOffset>0x072C</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PPSCTRL</name>
					<description>Control the duration between 2-pulses of PPS signal output  This controls the duration between 2 pulses of the PPS output signal. By default the control is set to 1 second between pulses. The duration of the pulses for valid settings is mentioned below. 0000 = 1.0 sec (Binary and Digital Rollover)  0001 = 0.5 sec (Binary Rollover), 0.536 sec (Digital Rollover) 0010 = 0.25 sec (Binary Rollover), 0.26 sec (Digital Rollover)  0011 = 0.125 sec (Binary Rollover), 0.13 sec (Digital Rollover)  ... 1111 = 15.28 msec (Binary Rollover), 32.77 microsec (Digital Rollover)</description>
					<bitRange>[3:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:4]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>AUXNANOSECONDS</name>
			<description>Auxiliary time stamp nanoseconds register</description>
			<addressOffset>0x0730</addressOffset>
			<access>read-only</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>AUXNS</name>
					<description>Lower 32 bits (nano-seconds field) of the auxiliary time stamp.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>AUXSECONDS</name>
			<description>Auxiliary time stamp seconds register</description>
			<addressOffset>0x0734</addressOffset>
			<access>read-only</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>AUXS</name>
					<description>Lower 32 bits of the Seconds field of the auxiliary time stamp .</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DMA_BUS_MODE</name>
			<description>Bus Mode Register</description>
			<addressOffset>0x1000</addressOffset>
			<access>read-write</access>
			<resetValue>0x00020100</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SWR</name>
					<description>Software reset This register field can be read by the application (Read), can be set to 1 by the application with a register write of 1 (Write Set), and is cleared to 0 by the Ethernet core (Self Clear). The application cannot clear this type of field, and a register write of 0 to this bit has no effect on this field.  When this bit is set, the MAC DMA Controller resets all MAC Subsystem internal registers and logic. It is cleared automatically after the reset operation has completed in all of the core clock domains. Read a 0 value in this bit before re-programming any register of the core.  The reset operation is completed only when all the resets in all the active clock domains are de-asserted. Hence it is essential that all the PHY inputs clocks (applicable for the selected PHY interface) are present for software reset completion.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>DA</name>
					<description>DMA arbitration scheme 0 = Round-robin with Rx:Tx priority given in bits [15:14]  1 = Rx has priority over Tx</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>DSL</name>
					<description>Descriptor skip length This bit specifies the number of Word/Dword/Lword (depending on 32/64/128-bit bus) to skip between two unchained descriptors. The address skipping starts from the end of current descriptor to the start of next descriptor. When DSL value equals zero, then the descriptor table is taken as contiguous by the DMA, in Ring mode.</description>
					<bitRange>[6:2]</bitRange>
				</field>
				<field>
					<name>ATDS</name>
					<description>Alternate descriptor size When set, the alternate descriptor (see Section 24.10.3) size is increased to 32 bytes (8 DWORDS). This is required when the Advanced Time-Stamp feature or Full IPC Offload Engine is enabled in the receiver.  When reset, the descriptor size reverts back to 4 DWORDs (16 bytes).</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>PBL</name>
					<description>Programmable burst length These bits indicate the maximum number of beats to be transferred in one DMA transaction. This will be the maximum value that is used in a single block Read/Write. The DMA will always attempt to burst as specified in PBL each time it starts a Burst transfer on the host bus. PBL can be programmed with permissible values of 1, 2, 4, 8, 16, and 32. Any other value will result in undefined behavior. When USP is set high, this PBL value is applicable for TxDMA transactions only.  The PBL values have the following limitations.  The maximum number of beats (PBL) possible is limited by the size of the Tx FIFO and Rx FIFO in the MTL layer and the data bus width on the DMA. The FIFO has a constraint that the maximum beat supported is half the depth of the FIFO, except when specified (as given below). For different data bus widths and FIFO sizes, the valid PBL range (including x8 mode) is provided in the following table. If the PBL is common for both transmit and receive DMA, the minimum Rx FIFO and Tx FIFO depths must be considered. Do not program out-of-range PBL values, because the system may not behave properly.</description>
					<bitRange>[13:8]</bitRange>
				</field>
				<field>
					<name>PR</name>
					<description>Rx-to-Tx priority ratio RxDMA requests given priority over TxDMA requests in the following ratio. This is valid only when the DA bit is reset.  00 = 1-to-1 01 = 2-to-1 10 = 3-to-1 11 = 4-to-1</description>
					<bitRange>[15:14]</bitRange>
				</field>
				<field>
					<name>FB</name>
					<description>Fixed burst This bit controls whether the AHB Master interface performs fixed burst transfers or not. When set, the AHB will use only SINGLE, INCR4, INCR8 or INCR16 during start of normal burst transfers. When reset, the AHB will use SINGLE and INCR burst transfer operations.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>RPBL</name>
					<description>RxDMA PBL These bits indicate the maximum number of beats to be transferred in one RxDMA transaction. This will be the maximum value that is used in a single block Read/Write. The RxDMA will always attempt to burst as specified in RPBL each time it starts a Burst transfer on the host bus. RPBL can be programmed with permissible values of 1, 2, 4, 8, 16, and 32. Any other value will result in undefined behavior. These bits are valid and applicable only when USP is set high.</description>
					<bitRange>[22:17]</bitRange>
				</field>
				<field>
					<name>USP</name>
					<description>Use separate PBL When set high, it configures the RxDMA to use the value configured in bits [22:17] as PBL while the PBL value in bits [13:8] is applicable to TxDMA operations only. When reset to low, the PBL value in bits [13:8] is applicable for both DMA engines.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>PBL8X</name>
					<description>8 x PBL mode When set high, this bit multiplies the PBL value programmed (bits [22:17] and bits [13:8]) eight times. Thus the DMA will transfer data in to a maximum of 8, 16, 32, 64, 128, and 256 beats depending on the PBL value.  This bit function is not backward compatible. Before version 3.50a, this bit was 4xPBL.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>AAL</name>
					<description>Address-aligned beats When this bit is set high and the FB bit equals 1, the AHB interface generates all bursts aligned to the start address LS bits. If the FB bit equals 0, the first burst (accessing the data buffer's start address) is not aligned, but subsequent bursts are aligned to the address.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>MB</name>
					<description>Mixed burst When this bit is set high and FB bit is low, the AHB master interface will start all bursts of length more than 16 with INCR (undefined burst) whereas it will revert to fixed burst transfers (INCRx and SINGLE) for burst-length of 16 and below.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>TXPR</name>
					<description>When set, this bit indicates that the transmit DMA has higher priority than the receive DMA during arbitration for the system-side bus.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:28]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DMA_TRANS_POLL_DEMAND</name>
			<description>Transmit poll demand register</description>
			<addressOffset>0x1004</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TPD</name>
					<description>Transmit poll demand This register field can be read by the application, and when a write operation is performed with any data value, an event is triggered.  When these bits are written with any value, the DMA reads the current descriptor pointed to by the Current Host Transmit Descriptor register (Section 24.6.40). If that descriptor is not available (owned by Host), transmission returns to the Suspend state and bit 2 in the DMA_STAT Register is asserted. If the descriptor is available, transmission resumes.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DMA_REC_POLL_DEMAND</name>
			<description>Receive poll demand register</description>
			<addressOffset>0x1008</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RPD</name>
					<description>Receive poll demand This register field can be read by the application, and when a write operation is performed with any data value, an event is triggered.  When these bits are written with any value, the DMA reads the current descriptor pointed to by the Current Host Receive Descriptor register (Section 24.6.41). If that descriptor is not available (owned by Host), reception returns to the Suspended state and bit 7 in the DMA_STAT Register is not asserted. If the descriptor is available, the Receive DMA returns to active state.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DMA_REC_DES_ADDR</name>
			<description>Receive descriptor list address register</description>
			<addressOffset>0x100C</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SRL</name>
					<description>Start of receive list This field contains the base address of the First Descriptor in the Receive Descriptor list. The LSB bits [1/2/3:0] for 32/64/128-bit bus width) will be ignored and taken as all-zero by the DMA internally. Hence these LSB bits are Read Only.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DMA_TRANS_DES_ADDR</name>
			<description>Transmit descriptor list address register</description>
			<addressOffset>0x1010</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SRL</name>
					<description>Start of transmit list This field contains the base address of the First Descriptor in the Transmit Descriptor list. The LSB bits [1/2/3:0] for 32/64/128-bit bus width) will be ignored and taken as all-zero by the DMA internally. Hence these LSB bits are Read Only.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
