pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
		<register>
			<name>DMA_STAT</name>
			<description>Status register</description>
			<addressOffset>0x1014</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TI</name>
					<description>Transmit interrupt  This bit indicates that frame transmission is finished and TDES1[31] is set in the First Descriptor.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>TPS</name>
					<description>Transmit process stopped  This bit is set when the transmission is stopped.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>TU</name>
					<description>Transmit buffer unavailable   This bit indicates that the Next Descriptor in the Transmit List is owned by the host and cannot be acquired by the DMA. Transmission is suspended. Bits[22:20] explain the Transmit Process state transitions. To resume processing transmit descriptors, the host should change the ownership of the bit of the descriptor and then issue a Transmit Poll Demand command.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>TJT</name>
					<description>Transmit jabber timeout   This bit indicates that the Transmit Jabber Timer expired, meaning that the transmitter had been excessively active. The transmission process is aborted and placed in the Stopped state. This causes the Transmit Jabber Timeout TDES0[14] flag to assert.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>OVF</name>
					<description>Receive overflow This bit indicates that the Receive Buffer had an Overflow during frame reception. If the partial frame is transferred to application, the overflow status is set in RDES0[11].</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>UNF</name>
					<description>Transmit underflow This bit indicates that the Transmit Buffer had an Underflow during frame transmission. Transmission is suspended and an Underflow Error TDES0[1] is set.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RI</name>
					<description>Receive interrupt  This bit indicates the completion of frame reception. Specific frame status information has been posted in the descriptor. Reception remains in the Running state.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RU</name>
					<description>Receive buffer unavailable  This bit indicates that the Next Descriptor in the Receive List is owned by the host and cannot be acquired by the DMA. Receive Process is suspended. To resume processing Receive descriptors, the host should change the ownership of the descriptor and issue a Receive Poll Demand command. If no Receive Poll Demand is issued, Receive Process resumes when the next recognized incoming frame is received. This bit is set only when the previous Receive Descriptor was owned by the DMA.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RPS</name>
					<description>Received process stopped This bit is asserted when the Receive Process enters the Stopped state.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RWT</name>
					<description>Receive watchdog timeout  This bit is asserted when a frame with a length greater than 2,048 bytes is received (10,240 when Jumbo Frame mode is enabled).</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>ETI</name>
					<description>Early transmit interrupt  This bit indicates that the frame to be transmitted was fully transferred to the MTL Transmit FIFO.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[12:11]</bitRange>
				</field>
				<field>
					<name>FBI</name>
					<description>Fatal bus error interrupt This bit indicates that a bus error occurred, as detailed in bits [25:23]. When this bit is set, the corresponding DMA engine disables all its bus accesses.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>ERI</name>
					<description>Early receive interrupt  This bit indicates that the DMA had filled the first data buffer of the packet. Receive Interrupt bit 6 in this register automatically clears this bit.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>AIE</name>
					<description>Abnormal interrupt summary  Abnormal Interrupt Summary bit value is the logical OR of the following when the corresponding interrupt bits are enabled in the DMA_INT_EN register:  DMA_STAT register, bit 1: Transmit process stopped DMA_STAT register, bit 3: Transmit jabber timeout DMA_STAT register, bit 4: Receive overflow DMA_STAT register, bit 5: Transmit underflow DMA_STAT register, bit 7: Receiver buffer unavailable DMA_STAT register, bit 8: Receive process stopped DMA_STAT register, bit 9: Receive watchdog timeout DMA_STAT register, bit 10: Early transmit interrupt DMA_STAT register, bit 13: Fatal bus error Only unmasked bits affect the Abnormal Interrupt Summary bit.  This is a sticky bit and must be cleared each time a corresponding bit that causes AIS to be set is cleared.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>NIS</name>
					<description>Normal interrupt summary Normal Interrupt Summary bit value is the logical OR of the following when the corresponding interrupt bits are enabled in the DMA_INT_EN register:  DMA_STAT register, bit 0: Transmit interrupt DMA_STAT register, bit 2: Transmit buffer unavailable DMA_STAT register, bit 6: Receive interrupt DMA_STAT register, bit 14: Early receive interrupt Only unmasked bits affect the Normal Interrupt Summary bit.  This is a sticky bit and must be cleared (by writing a 1 to this bit) each time a corresponding bit that causes NIS to be set is cleared.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:17]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DMA_OP_MODE</name>
			<description>Operation mode register</description>
			<addressOffset>0x1018</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>SR</name>
					<description>Start/stop receive When this bit is set, the Receive process is placed in the Running state. The DMA attempts to acquire the descriptor from the Receive list and processes incoming frames. Descriptor acquisition is attempted from the current position in the list, which is the address set by the DMA_REC_DES_ADDR register or the position retained when the Receive process was previously stopped. If no descriptor is owned by the DMA, reception is suspended and Receive Buffer Unavailable bit (bit 7 in DMA_STAT register) is set. The Start Receive command is effective only when reception has stopped. If the command was issued before setting the DMA_REC_DES_ADDR, DMA behavior is unpredictable.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>OSF</name>
					<description>Operate on second frame When this bit is set, this bit instructs the DMA to process a second frame of Transmit data even before status for first frame is obtained.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RTC</name>
					<description>Receive threshold control These two bits control the threshold level of the MTL Receive FIFO. Transfer (request) to DMA starts when the frame size within the MTL Receive FIFO is larger than the threshold. In addition, full frames with a length less than the threshold are transferred automatically. Note that value of 11 is not applicable if the configured Receive FIFO size is 128 bytes. These bits are valid only when the RSF bit is zero, and are ignored when the RSF bit is set to 1.  00 = 64 01 = 32 10 = 96 11 = 128</description>
					<bitRange>[4:3]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>FUF</name>
					<description>Forward undersized good frames When set, the Rx FIFO will forward Undersized frames (frames with no Error and length less than 64 bytes) including pad-bytes and CRC).  When reset, the Rx FIFO will drop all frames of less than 64 bytes, unless it is already transferred due to lower value of Receive Threshold (e.g., RTC = 01).</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>FEF</name>
					<description>Forward error frames When this bit is reset, the Rx FIFO drops frames with error status (CRC error, collision error, GMII_ER, giant frame, watchdog timeout, overflow). However, if the frame's start byte (write) pointer is already transferred to the read controller side (in Threshold mode), then the frames are not dropped. When FEF is set, all frames except runt error frames are forwarded to the DMA. But when RxFIFO overflows when a partial frame is written, then such frames are dropped even when FEF is set.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[12:8]</bitRange>
				</field>
				<field>
					<name>ST</name>
					<description>Start/Stop Transmission Command  When this bit is set, transmission is placed in the Running state, and the DMA checks the Transmit List at the current position for a frame to be transmitted. Descriptor acquisition is attempted either from the current position in the list, which is the Transmit List Base Address set by the DMA_TRANS_DES_ADDR register or from the position retained when transmission was stopped previously. If the current descriptor is not owned by the DMA, transmission enters the Suspended state and Transmit Buffer Unavailable (DMA_STAT register, bit 2) is set. The Start Transmission command is effective only when transmission is stopped. If the command is issued before setting the DMA_TRANS_DES_ADDR register, then the DMA behavior is unpredictable.  When this bit is reset, the transmission process is placed in the Stopped state after completing the transmission of the current frame. The Next Descriptor position in the Transmit List is saved, and becomes the current position when transmission is restarted. The stop transmission command is effective only the transmission of the current frame is complete or when the transmission is in the Suspended state.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>TTC</name>
					<description>Transmit threshold control These three bits control the threshold level of the MTL Transmit FIFO. Transmission starts when the frame size within the MTL Transmit FIFO is larger than the threshold. In addition, full frames with a length less than the threshold are also transmitted. These bits are used only when the TSF bit (Bit 21) is reset. 000 = 64 001 = 128 010 = 192 011 = 256 100 = 40 101 = 32 110 = 24 111 = 16</description>
					<bitRange>[16:14]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[19:17]</bitRange>
				</field>
				<field>
					<name>FTF</name>
					<description>Flush transmit FIFO This register field can be read by the application (Read), can be set to 1 by the application with a register write of 1 (Write Set), and is cleared to 0 by the Ethernet core (Self Clear). The application cannot clear this type of field, and a register write of 0 to this bit has no effect on this field.  When this bit is set, the transmit FIFO controller logic is reset to its default values and thus all data in the Tx FIFO is lost/flushed. This bit is cleared internally when the flushing operation is completed fully. The Operation Mode register should not be written to until this bit is cleared. The data which is already accepted by the MAC transmitter will not be flushed. It will be scheduled for transmission and will result in underflow and runt frame transmission.  The flush operation completes only after emptying the TxFIFO of its contents and all the pending Transmit Status of the transmitted frames are accepted by the host. In order to complete this flush operation, the PHY transmit clock is required to be active.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>TSF</name>
					<description>Transmit store and forward When this bit is set, transmission starts when a full frame resides in the MTL Transmit FIFO. When this bit is set, the TTC values specified in this register (bits [16:14]) are ignored. This bit should be changed only when transmission is stopped.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[23:22]</bitRange>
				</field>
				<field>
					<name>DFF</name>
					<description>Disable flushing of received frames When this bit is set, the RxDMA does not flush any frames due to the unavailability of receive descriptors/buffers as it does normally when this bit is reset. (See).</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>RSF</name>
					<description>Receive store and forward When this bit is set, the MTL only reads a frame from the Rx FIFO after the complete frame has been written to it, ignoring RTC bits. When this bit is reset, the Rx FIFO operates in Cut-Through mode, subject to the threshold specified by the RTC bits.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>DT</name>
					<description>Disable Dropping of TCP/IP Checksum Error Frames  When this bit is set, the core does not drop frames that only have errors detected by the Receive Checksum Offload engine. Such frames do not have any errors (including FCS error) in the Ethernet frame received by the MAC but have errors in the encapsulated payload only. When this bit is reset, all error frames are dropped if the FEF bit is reset.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:27]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DMA_INT_EN</name>
			<description>Interrupt enable register</description>
			<addressOffset>0x101C</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TIE</name>
					<description>Transmit interrupt enable When this bit is set with Normal Interrupt Summary Enable (bit 16 in this register), Transmit Interrupt is enabled. When this bit is reset, Transmit Interrupt is disabled.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>TSE</name>
					<description>Transmit stopped enable When this bit is set with Abnormal Interrupt Summary Enable (bit 15 in this register), Transmission Stopped Interrupt is enabled. When this bit is reset, Transmission Stopped Interrupt is disabled.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>TUE</name>
					<description>Transmit buffer unavailable enable When this bit is set with Normal Interrupt Summary Enable (bit 16 in this register), Transmit Buffer Unavailable Interrupt is enabled. When this bit is reset, Transmit Buffer Unavailable Interrupt is disabled.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>TJE</name>
					<description>Transmit jabber timeout enable When this bit is set with Abnormal Interrupt Summary Enable (bit 15 in this register), Transmit Jabber Timeout Interrupt is enabled. When this bit is reset, Transmit Jabber Timeout Interrupt is disabled.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>OVE</name>
					<description>Overflow interrupt enable When this bit is set with Abnormal Interrupt Summary Enable (bit 15 in this register), Receive Overflow Interrupt is enabled. When this bit is reset, Overflow Interrupt is disabled.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>UNE</name>
					<description>Underflow interrupt enable When this bit is set with Abnormal Interrupt Summary Enable (bit 15 in this register), Transmit Underflow Interrupt is enabled. When this bit is reset, Underflow Interrupt is disabled.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RIE</name>
					<description>Receive interrupt enable When this bit is set with Normal Interrupt Summary Enable (bit 16 in this register), Receive Interrupt is enabled. When this bit is reset, Receive Interrupt is disabled.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RUE</name>
					<description>Receive buffer unavailable enable When this bit is set with Abnormal Interrupt Summary Enable (bit 15 in this register), Receive Buffer Unavailable Interrupt is enabled. When this bit is reset, the Receive Buffer Unavailable Interrupt is disabled.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RSE</name>
					<description>Received stopped enable When this bit is set with Abnormal Interrupt Summary Enable (bit 15 in this register), Receive Stopped Interrupt is enabled. When this bit is reset, Receive Stopped Interrupt is disabled.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RWE</name>
					<description>Receive watchdog timeout enable When this bit is set with Abnormal Interrupt Summary Enable (bit 15 in this register), the Receive Watchdog Timeout Interrupt is enabled. When this bit is reset, Receive Watchdog Timeout Interrupt is disabled.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>ETE</name>
					<description>Early transmit interrupt enable When this bit is set with an Abnormal Interrupt Summary Enable (bit 15 in this register), Early Transmit Interrupt is enabled. When this bit is reset, Early Transmit Interrupt is disabled.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[12:11]</bitRange>
				</field>
				<field>
					<name>FBE</name>
					<description>Fatal bus error enable When this bit is set with Abnormal Interrupt Summary Enable (bit 15 in this register), the Fatal Bus Error Interrupt is enabled. When this bit is reset, Fatal Bus Error Enable Interrupt is disabled.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>ERE</name>
					<description>Early receive interrupt enable When this bit is set with Normal Interrupt Summary Enable (bit 16 in this register), Early Receive Interrupt is enabled. When this bit is reset, Early Receive Interrupt is disabled.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>AIE</name>
					<description>Abnormal interrupt summary enable When this bit is set, an Abnormal Interrupt is enabled. When this bit is reset, an Abnormal Interrupt is disabled. This bit enables the following bits  DMA_STAT register, bit 1: Transmit process stopped DMA_STAT register, bit 3: Transmit jabber timeout DMA_STAT register, bit 4: Receive overflow DMA_STAT register, bit 5: Transmit underflow DMA_STAT register, bit 7: Receiver buffer unavailable DMA_STAT register, bit 8: Receive process stopped DMA_STAT register, bit 9: Receive watchdog timeout DMA_STAT register, bit 10: Early transmit interrupt DMA_STAT register, bit 13: Fatal bus error</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>NIE</name>
					<description>Normal interrupt summary enable When this bit is set, a normal interrupt is enabled. When this bit is reset, a normal interrupt is disabled. This bit enables the following bits:  DMA_STAT register, bit 0: Transmit interrupt DMA_STAT register, bit 2: Transmit buffer unavailable DMA_STAT register, bit 6: Receive interrupt DMA_STAT register, bit 14: Early receive interrupt</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:17]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DMA_MFRM_BUFOF</name>
			<description>Missed frame and buffer overflow register</description>
			<addressOffset>0x1020</addressOffset>
			<access>read-only</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FMC</name>
					<description>Number of frames missed This register field can be read by the application (Read), can be set to 1 by the Ethernet core on a certain internal event (Self Set), and is automatically cleared to 0 on a register read. A register write of 0 has no effect on this field.  Indicates the number of frames missed by the controller due to the Host Receive Buffer being unavailable. This counter is incremented each time the DMA discards an incoming frame. The counter is cleared when this register is read with.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>OC</name>
					<description>Overflow bit for missed frame counter This register field can be read by the application (Read), can be set to 1 by the Ethernet core on a certain internal event (Self Set), and is automatically cleared to 0 on a register read. A register write of 0 has no effect on this field.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>FMA</name>
					<description>Number of frames missed by the application This register field can be read by the application (Read), can be set to 1 by the Ethernet core on a certain internal event (Self Set), and is automatically cleared to 0 on a register read. A register write of 0 has no effect on this field.  Indicates the number of frames missed by the application. This counter is incremented each time the MTL asserts the sideband signal mtl_rxoverflow_o. The counter is cleared when this register is read with .</description>
					<bitRange>[27:17]</bitRange>
				</field>
				<field>
					<name>OF</name>
					<description>Overflow bit for FIFO overflow counter This register field can be read by the application (Read), can be set to 1 by the Ethernet core on a certain internal event (Self Set), and is automatically cleared to 0 on a register read. A register write of 0 has no effect on this field.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:29]</bitRange>
				</field>
			</fields>
		</register>
