pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
		<register>
			<name>DMA_REC_INT_WDT</name>
			<description>Receive interrupt watchdog timer register</description>
			<addressOffset>0x1024</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RIWT</name>
					<description>RI watchdog timeout Indicates the number of system clock cycles multiplied by 256 for which the watchdog timer is set. The watchdog timer gets triggered with the programmed value after the RxDMA completes the transfer of a frame for which the RI status bit is not set due to the setting in the corresponding descriptor RDES1[31]. When the watch-dog timer runs out, the RI bit is set and the timer is stopped. The watchdog timer is reset when RI bit is set high due to automatic setting of RI as per RDES1[31] of any received frame.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DMA_CURHOST_TRANS_DES</name>
			<description>Current host transmit descriptor register</description>
			<addressOffset>0x1048</addressOffset>
			<access>read-only</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>HTD</name>
					<description>Host Transmit Descriptor Address Pointer  Cleared on Reset. Pointer updated by DMA during operation.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DMA_CURHOST_REC_DES</name>
			<description>Current host receive descriptor register</description>
			<addressOffset>0x104C</addressOffset>
			<access>read-only</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>HRD</name>
					<description>Host Receive Descriptor Address Pointer  Cleared on Reset. Pointer updated by DMA during operation.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DMA_CURHOST_TRANS_BUF</name>
			<description>Current host transmit buffer address register</description>
			<addressOffset>0x1050</addressOffset>
			<access>read-only</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>HTB</name>
					<description>Host Transmit Buffer Address Pointer  Cleared on Reset. Pointer updated by DMA during operation.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DMA_CURHOST_REC_BUF</name>
			<description>Current host receive buffer address register</description>
			<addressOffset>0x1054</addressOffset>
			<access>read-only</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>HRB</name>
					<description>Host Receive Buffer Address Pointer  Cleared on Reset. Pointer updated by DMA during operation.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
	</registers>
</peripheral>
		<peripheral>
			<name>ATIMER</name>
			<description>Product name title=UM10430 Chapter title=LPC18xx Alarm timer Modification date=1/7/2011 Major revision=0 Minor revision=6 </description>
			<groupName>ATIMER</groupName>
			<baseAddress>0x40040000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ATIMER</name>
				<value>46</value>
			</interrupt>
			<registers>
				<register>
					<name>DOWNCOUNTER</name>
					<description>Downcounter register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CVAL</name>
							<description>When equal to zero an interrupt is raised. When equal to zero PRESET is loaded and counting continues.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PRESET</name>
					<description>Preset value register</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0x000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRESETVAL</name>
							<description>Value loaded in DOWNCOUNTER when DOWNCOUNTER equals zero</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CLR_EN</name>
					<description>Interrupt clear enable register</description>
					<addressOffset>0xFD8</addressOffset>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLR_EN</name>
							<description>Writing a 1 to this bit clears the interrupt enable bit in the ENABLE register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SET_EN</name>
					<description>Interrupt set enable register</description>
					<addressOffset>0xFDC</addressOffset>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SET_EN</name>
							<description>Writing a 1 to this bit sets the interrupt enable bit in the ENABLE register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Status register</description>
					<addressOffset>0xFE0</addressOffset>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STAT</name>
							<description>A 1 in this bit shows that the STATUS interrupt has been raised.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ENABLE</name>
					<description>Enable register</description>
					<addressOffset>0xFE4</addressOffset>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EN</name>
							<description>A 1 in this bit shows that the STATUS interrupt has been enabled and that the STATUS interrupt request signal is asserted when STAT = 1 in the STATUS register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CLR_STAT</name>
					<description>Clear register</description>
					<addressOffset>0xFE8</addressOffset>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CSTAT</name>
							<description>Writing a 1 to this bit clears the STATUS interrupt bit in the STATUS register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SET_STAT</name>
					<description>Set register</description>
					<addressOffset>0xFEC</addressOffset>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SSTAT</name>
							<description>Writing a 1 to this bit sets the STATUS interrupt bit in the STATUS register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
