pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
				</field>
				<field>
					<name>WAKEUP0CTRL</name>
					<description>WAKEUP0 pin input/output control</description>
					<bitRange>[15:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INPUT_TO_EVENT_ROUTE</name>
							<description>Input to event router.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EVENT_ROUTER_EVENT_O</name>
							<description>Event router event output.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_TO_EVENT_ROUTE</name>
							<description>Input to event router.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>WAKEUP1CTRL</name>
					<description>WAKEUP1 pin input/output control</description>
					<bitRange>[17:16]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INPUT_TO_EVENT_ROUTE</name>
							<description>Input to event router.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EVENT_ROUTER_EVENT_O</name>
							<description>Event router event output.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_TO_EVENT_ROUTE</name>
							<description>Input to event router.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:18]</bitRange>

				</field>
			</fields>
		</register>
		
		<register>
			<name>M4MEMMAP</name>
			<description>ARM Cortex-M4 memory mapping</description>
			<addressOffset>0x100</addressOffset>
			<access>read-write</access>
			<resetValue>0x10400</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>M4MAP</name>
					<description>Shadow address when accessing memory at address 0x0000 0000</description>
					<bitRange>[31:12]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CREG5</name>
			<description>Chip configuration register 5. Controls JTAG access.</description>
			<addressOffset>0x118</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>M4TAPSEL</name>
					<description>tbd</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:9]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DMAMUX</name>
			<description>DMA muxing control</description>
			<addressOffset>0x11C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>DMAMUXCH0</name>
					<description>Select DMA to peripheral connection for DMA peripheral 0.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SPIFI</name>
							<description>SPIFI</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SCT_MATCH_2</name>
							<description>SCT match 2</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>T3_MATCH_1</name>
							<description>T3 match 1</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMAMUXCH1</name>
					<description>Select DMA to peripheral connection for DMA peripheral 1</description>
					<bitRange>[3:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>TIMER_0_MATCH_0</name>
							<description>Timer 0 match 0</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USART0_TRANSMIT</name>
							<description>USART0 transmit</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMAMUXCH2</name>
					<description>Select DMA to peripheral connection for DMA peripheral 2.</description>
					<bitRange>[5:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>TIMER_0_MATCH_1</name>
							<description>Timer 0 match 1</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USART0_RECEIVE</name>
							<description>USART0 receive</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMAMUXCH3</name>
					<description>Select DMA to peripheral connection for DMA peripheral 3.</description>
					<bitRange>[7:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>TIMER_1_MATCH_0</name>
							<description>Timer 1 match 0</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>UART1_TRANSMIT</name>
							<description>UART1 transmit</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>I2S1_CHANNEL_0</name>
							<description>I2S1 channel 0</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SSP1_TRANSMIT</name>
							<description>SSP1 transmit</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMAMUXCH4</name>
					<description>Select DMA to peripheral connection for DMA peripheral 4.</description>
					<bitRange>[9:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>TIMER_1_MATCH_1</name>
							<description>Timer 1 match 1</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>UART1_RECEIVE</name>
							<description>UART1 receive</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>I2S1_CHANNEL_1</name>
							<description>I2S1 channel 1</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SSP1_RECEIVE</name>
							<description>SSP1 receive</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMAMUXCH5</name>
					<description>Select DMA to peripheral connection for DMA peripheral 5.</description>
					<bitRange>[11:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>TIMER_2_MATCH_0</name>
							<description>Timer 2 match 0</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USART2_TRANSMIT</name>
							<description>USART2 transmit</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SSP1_TRANSMIT</name>
							<description>SSP1 transmit</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMAMUXCH6</name>
					<description>Selects DMA to peripheral connection for DMA peripheral 6.</description>
					<bitRange>[13:12]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>TIMER_2_MATCH_1</name>
							<description>Timer 2 match 1</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USART2_RECEIVE</name>
							<description>USART2 receive</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SSP1_RECEIVE</name>
							<description>SSP1 receive</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMAMUXCH7</name>
					<description>Selects DMA to peripheral connection for DMA peripheral 7.</description>
					<bitRange>[15:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>TIMER_3_MATCH_L_0</name>
							<description>Timer 3 match l 0</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USART3_TRANSMIT</name>
							<description>USART3 transmit</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SCT_MATCH_OUTPUT_0</name>
							<description>SCT match output 0</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMAMUXCH8</name>
					<description>Select DMA to peripheral connection for DMA peripheral 8.</description>
					<bitRange>[17:16]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>TIMER_3_MATCH_1</name>
							<description>Timer 3 match 1</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USART3_RECEIVE</name>
							<description>USART3 receive</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SCT_MATCH_OUTPUT_1</name>
							<description>SCT match output 1</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMAMUXCH9</name>
					<description>Select DMA to peripheral connection for DMA peripheral 9.</description>
					<bitRange>[19:18]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SSP0_RECEIVE</name>
							<description>SSP0 receive</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>I2S0_CHANNEL_0</name>
							<description>I2S0 channel 0</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SCT_MATCH_OUTPUT_1</name>
							<description>SCT match output 1</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMAMUXCH10</name>
					<description>Select DMA to peripheral connection for DMA peripheral 10.</description>
					<bitRange>[21:20]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SSP0_TRANSMIT</name>
							<description>SSP0 transmit</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>I2S0_CHANNEL_1</name>
							<description>I2S0 channel 1</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SCT_MATCH_OUTPUT_0</name>
							<description>SCT match output 0</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMAMUXCH11</name>
					<description>Selects DMA to peripheral connection for DMA peripheral 11.</description>
					<bitRange>[23:22]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SSP1_RECEIVE</name>
							<description>SSP1 receive</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USART0_TRANSMIT</name>
							<description>USART0 transmit</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMAMUXCH12</name>
					<description>Select DMA to peripheral connection for DMA peripheral 12.</description>
					<bitRange>[25:24]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SSP1_TRANSMIT</name>
							<description>SSP1 transmit</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USART0_RECEIVE</name>
							<description>USART0 receive</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMAMUXCH13</name>
					<description>Select DMA to peripheral connection for DMA peripheral 13.</description>
					<bitRange>[27:26]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ADC0</name>
							<description>ADC0</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SSP1_RECEIVE</name>
							<description>SSP1 receive</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USART3_RECEIVE</name>
							<description>USART3 receive</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMAMUXCH14</name>
					<description>Select DMA to peripheral connection for DMA peripheral 14.</description>
					<bitRange>[29:28]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ADC1</name>
							<description>ADC1</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SSP1_TRANSMIT</name>
							<description>SSP1 transmit</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USART3_TRANSMIT</name>
							<description>USART3 transmit</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMAMUXCH15</name>
					<description>Select DMA to peripheral connection for DMA peripheral 15.</description>
					<bitRange>[31:30]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DAC</name>
							<description>DAC</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SCT_MATCH_OUTPUT_3</name>
							<description>SCT match output 3</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TIMER_3_MATCH_0</name>
							<description>Timer 3 match 0</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
			</fields>
		</register>
		<register>
			<name>ETBCFG</name>
			<description>ETB RAM configuration</description>
			<addressOffset>0x128</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ETB</name>
					<description>Select SRAM interface</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ETB_ACCESSES_SRAM_AT</name>
							<description>ETB accesses SRAM at address 0x2000 C000.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AHB_ACCESSES_SRAM_AT</name>
							<description>AHB accesses SRAM at address 0x2000 C000.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:1]</bitRange>
					
