pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
				</field>
			</fields>
		</register>
		<register>
			<name>CREG6</name>
			<description>Chip configuration register 6.</description>
			<addressOffset>0x12C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>ETHMODE</name>
					<description>Selects the Ethernet mode. Reset the ethernet after changing the PHY interface. All other settings are reserved.</description>
					<bitRange>[2:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>MII</name>
							<description>MII</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RMII</name>
							<description>RMII</description>
							<value>0x4</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[3:3]</bitRange>

				</field>
				<field>
					<name>TIMCTRL</name>
					<description>Selects the functionality of the SCT outputs.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>COMBINE_SCT_TMATCH</name>
							<description>Combine SCT and timer match outputs. SCT outputs are ORed with timer outputs.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SCT_ONLY</name>
							<description>SCT outputs only. SCT outputs are used without timer match outputs.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[11:5]</bitRange>

				</field>
				<field>
					<name>I2S0_TX_SCK_IN_SEL</name>
					<description>I2S0_TX_SCK input select</description>
					<bitRange>[12:12]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>I2_S_CLOCK_SELECTED_</name>
							<description>I2 S clock selected as defined by the I2S transmit mode register Table 832.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AUDIO_PLL_FOR_I2S_TR</name>
							<description>Audio PLL for I2S transmit clock MCLK input and MCLK output. The I2S must be configured in slave mode.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>I2S0_RX_SCK_IN_SEL</name>
					<description>I2S0_RX_SCK input select</description>
					<bitRange>[13:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>I2_S_CLOCK_SELECTED_</name>
							<description>I2 S clock selected as defined by the I2S receive mode register Table 833.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AUDIO_PLL_FOR_I2S_RE</name>
							<description>Audio PLL for I2S receive clock MCLK input and MCLK output. The I2S must be configured in slave mode.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>I2S1_TX_SCK_IN_SEL</name>
					<description>I2S1_TX_SCK input select</description>
					<bitRange>[14:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>I2_S_CLOCK_SELECTED_</name>
							<description>I2 S clock selected as defined by the I2S transmit mode register Table 832.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AUDIO_PLL_FOR_I2S_TR</name>
							<description>Audio PLL for I2S transmit clock MCLK input and MCLK output. The I2S must be configured in slave mode.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>I2S1_RX_SCK_IN_SEL</name>
					<description>I2S1_RX_SCK input select</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>I2_S_CLOCK_SELECTED_</name>
							<description>I2 S clock selected as defined by the I2S receive mode register Table 833.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AUDIO_PLL_FOR_I2S_RE</name>
							<description>Audio PLL for I2S receive clock MCLK input and MCLK output. The I2S must be configured in slave mode.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EMC_CLK_SEL</name>
					<description>EMC_CLK divided clock select (see Section 22.1).</description>
					<bitRange>[16:16]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>EMC_CLK_DIV_NOT_DIVI</name>
							<description>EMC_CLK_DIV not divided.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EMC_CLK_DIV_DIVIDED_</name>
							<description>EMC_CLK_DIV divided by 2.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:17]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>M4TXEVENT</name>
			<description>Cortex-M4 TXEV event clear</description>
			<addressOffset>0x130</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TXEVCLR</name>
					<description>Cortex-M4 TXEV event.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NA</name>
							<description>Do nothing</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR_TXEV_EVENT_</name>
							<description>Clear TXEV event .</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:1]</bitRange>

