pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
						</field>
					</fields>
				</register>
				
				
				
				
			</registers>
		</peripheral>


		<peripheral>
			<name>CCU1</name>
			<description>Product name title=UM10430 Chapter title=LPC43xx Clock Control Unit (CCU)</description>
			<groupName>CCU1</groupName>
			<baseAddress>0x40051000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>PM</name>
					<description>CCU1 power mode register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PD</name>
							<description>Initiate power-down mode</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL_OPERATION_</name>
									<description>Normal operation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLOCKS_WITH_WAKE_UP_</name>
									<description>Clocks with wake-up mode enabled (W = 1) are disabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:1]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>BASE_STAT</name>
					<description>CCU1 base clocks status register</description>
					<addressOffset>0x004</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000FFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BASE_APB3_CLK_IND</name>
							<description>Base clock indicator for BASE_APB3_CLK 0 = All branch clocks switched off. 1 = At least one branch clock running.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>BASE_APB1_CLK_IND</name>
							<description>Base clock indicator for BASE_APB1_CLK 0 = All branch clocks switched off. 1 = At least one branch clock running.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>BASE_SPIFI_CLK_IND</name>
							<description>Base clock indicator for BASE_SPIFI_CLK 0 = All branch clocks switched off. 1 = At least one branch clock running.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>BASE_M3_CLK_IND</name>
							<description>Base clock indicator for BASE_M3_CLK 0 = All branch clocks switched off. 1 = At least one branch clock running.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[6:4]</bitRange>
						</field>
						<field>
							<name>BASE_USB0_CLK_IND</name>
							<description>Base clock indicator for BASE_USB0_CLK 0 = All branch clocks switched off. 1 = At least one branch clock running.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>BASE_USB1_CLK_IND</name>
							<description>Base clock indicator for BASE_USB1_CLK 0 = All branch clocks switched off. 1 = at least one branch clock running.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:9]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CLK_APB3_BUS_CFG</name>
					<description>CLK_APB3_BUS clock configuration register</description>
					<addressOffset>0x100</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CLOCK_IS_DISABLED_</name>
									<description>Clock is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLOCK_IS_ENABLED_</name>
									<description>Clock is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>AUTO_IS_DISABLED_</name>
									<description>Auto is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AUTO_IS_ENABLED_</name>
									<description>Auto is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>WAKE_UP_IS_DISABLED_</name>
									<description>Wake-up is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAKE_UP_IS_ENABLED_</name>
									<description>Wake-up is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>CLK_APB3_I2C1_CFG</name>
					<description>CLK_APB3_I2C1 clock configuration register</description>
					<addressOffset>0x0108</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CLOCK_IS_DISABLED_</name>
									<description>Clock is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLOCK_IS_ENABLED_</name>
									<description>Clock is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>AUTO_IS_DISABLED_</name>
									<description>Auto is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AUTO_IS_ENABLED_</name>
									<description>Auto is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>WAKE_UP_IS_DISABLED_</name>
									<description>Wake-up is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAKE_UP_IS_ENABLED_</name>
									<description>Wake-up is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>
							
