pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable status 0 = Auto is disabled. 1 = Auto is enabled.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable status 0 = Wake-up is disabled. 1 = Wake-up is enabled.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CLK_M4_RITIMER_STAT</name>
					<description>CLK_M4_RITIMER clock status register</description>
					<addressOffset>0x604</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable status 0 = clock is disabled. 1 = clock is enabled.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable status 0 = Auto is disabled. 1 = Auto is enabled.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable status 0 = Wake-up is disabled. 1 = Wake-up is enabled.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CLK_M4_USART2_STAT</name>
					<description>CLK_M4_USART2 clock status register</description>
					<addressOffset>0x060C</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable status 0 = clock is disabled. 1 = clock is enabled.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable status 0 = Auto is disabled. 1 = Auto is enabled.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable status 0 = Wake-up is disabled. 1 = Wake-up is enabled.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CLK_M4_USART3_STAT</name>
					<description>CLK_M4_USART3 clock status register</description>
					<addressOffset>0x0614</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable status 0 = clock is disabled. 1 = clock is enabled.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable status 0 = Auto is disabled. 1 = Auto is enabled.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable status 0 = Wake-up is disabled. 1 = Wake-up is enabled.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CLK_M4_TIMER2_STAT</name>
					<description>CLK_M4_TIMER2 clock status register</description>
					<addressOffset>0x061C</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable status 0 = clock is disabled. 1 = clock is enabled.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable status 0 = Auto is disabled. 1 = Auto is enabled.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable status 0 = Wake-up is disabled. 1 = Wake-up is enabled.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CLK_M4_TIMER3_STAT</name>
					<description>CLK_M4_TIMER3 clock status register</description>
					<addressOffset>0x0624</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable status 0 = clock is disabled. 1 = clock is enabled.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable status 0 = Auto is disabled. 1 = Auto is enabled.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable status 0 = Wake-up is disabled. 1 = Wake-up is enabled.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CLK_M4_SSP1_STAT</name>
					<description>CLK_M4_SSP1 clock status register</description>
					<addressOffset>0x062C</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable status 0 = clock is disabled. 1 = clock is enabled.</description>
							<bitRange>[0:0]</bitRange>

