pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
			</registers>
		</peripheral>

		<peripheral>
			<name>RGU</name>
			<description>Product name title=UM10503 Chapter title=LPC43xx Reset Generation
Unit (RGU) Modification date=7/20/2011 Major revision=0 Minor revision=13 </description>
			<groupName>RGU</groupName>
			<baseAddress>0x40053000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>RESET_CTRL0</name>
					<description>Reset control register 0</description>
					<addressOffset>0x100</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CORE_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>PERIPH_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after three clock cycles.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>MASTER_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after three clock cycles.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>WWDT_RST</name>
							<description>Writing a one to this bit has no effect.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CREG_RST</name>
							<description>Writing a one to this bit has no effect.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>BUS_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle. Do not use during normal operation</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>SCU_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>PINMUX_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>M4_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>LCD_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>USB0_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>USB1_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>DMA_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>SDIO_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>EMC_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>ETHERNET_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>GPIO_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_CTRL1</name>
					<description>Reset control register 1</description>
					<addressOffset>0x104</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>TIMER0_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>TIMER1_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>TIMER2_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>TIMER3_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RITIMER_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>SCT_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>MOTOCONPWM_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>QEI_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>ADC0_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>ADC1_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>DAC_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>UART0_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>UART1_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>UART2_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>UART3_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>I2C0_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>I2C1_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>SSP0_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>SSP1_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>I2S_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>SPIFI_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>CAN1_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>CAN0_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>M0APP_RST</name>
							<description>Writing a one activates the reset. Writing a 0 clears the reset. This bit must be cleared manually.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>SGPIO_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>SPI_RST</name>
							<description>Writing a one activates the reset. This bit is automatically cleared to 0 after one clock cycle.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_STATUS0</name>
					<description>Reset status register 0</description>
					<addressOffset>0x110</addressOffset>
					<access>read-write</access>
					<resetValue>0x55550050</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CORE_RST</name>
							<description>Status of the CORE_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPH_RST</name>
							<description>Status of the PERIPH_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>
							<bitRange>[3:2]</bitRange>
						</field>
						<field>
							<name>MASTER_RST</name>
							<description>Status of the MASTER_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>
							<bitRange>[5:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[7:6]</bitRange>
						</field>
						<field>
							<name>WWDT_RST</name>
							<description>Status of the WWDT_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reserved</description>
							<bitRange>[9:8]</bitRange>
						</field>
						<field>
							<name>CREG_RST</name>
							<description>Status of the CREG_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reserved</description>
							<bitRange>[11:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[13:12]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[15:14]</bitRange>
						</field>
						<field>
							<name>BUS_RST</name>
							<description>Status of the BUS_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>
							<bitRange>[17:16]</bitRange>
						</field>
						<field>
							<name>SCU_RST</name>
							<description>Status of the SCU_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>
							<bitRange>[19:18]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[21:20]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[23:22]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[25:24]</bitRange>
						</field>
						<field>
							<name>M4_RST</name>
							<description>Status of the M4_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>
							<bitRange>[27:26]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[29:28]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:30]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_STATUS1</name>
					<description>Reset status register 1</description>
					<addressOffset>0x114</addressOffset>
					<access>read-write</access>
					<resetValue>0x55555555</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LCD_RST</name>
							<description>Status of the LCD_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>USB0_RST</name>
							<description>Status of the USB0_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>
							<bitRange>[3:2]</bitRange>
						</field>
						<field>
							<name>USB1_RST</name>
							<description>Status of the USB1_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>
							<bitRange>[5:4]</bitRange>
						</field>
						<field>
							<name>DMA_RST</name>
							<description>Status of the DMA_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>
							<bitRange>[7:6]</bitRange>
						</field>
						<field>
							<name>SDIO_RST</name>
							<description>Status of the SDIO_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>
							<bitRange>[9:8]</bitRange>
						</field>
						<field>
							<name>EMC_RST</name>
							<description>Status of the EMC_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>
							<bitRange>[11:10]</bitRange>
						</field>
						<field>
							<name>ETHERNET_RST</name>
							<description>Status of the ETHERNET_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>
							<bitRange>[13:12]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[15:14]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[17:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[19:18]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[21:20]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[23:22]</bitRange>
						</field>
						<field>
							<name>GPIO_RST</name>
							<description>Status of the GPIO_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>
							<bitRange>[25:24]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[27:26]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[29:28]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:30]</bitRange>
						</field>
					</fields>
				</register>
