pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
				<register>
					<name>RESET_EXT_STAT1</name>
					<description>Reset external status register 1 for PERIPH_RST</description>
					<addressOffset>0x404</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CORE_RESET</name>
							<description>Reset activated by CORE_RST output. Write 0 to clear. 0 = Reset not activated 1 = Reset activated</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT2</name>
					<description>Reset external status register 2 for MASTER_RST</description>
					<addressOffset>0x408</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT4</name>
					<description>Reset external status register 4 for WWDT_RST</description>
					<addressOffset>0x410</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CORE_RESET</name>
							<description>Reset activated by CORE_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT5</name>
					<description>Reset external status register 5 for CREG_RST</description>
					<addressOffset>0x414</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CORE_RESET</name>
							<description>Reset activated by CORE_RST output. Write 0 to clear. 0 = Reset not activated 1 = Reset activated</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT8</name>
					<description>Reset external status register</description>
					<addressOffset>0x420</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT9</name>
					<description>Reset external status register</description>
					<addressOffset>0x0424</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT13</name>
					<description>Reset external status register</description>
					<addressOffset>0x434</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT16</name>
					<description>Reset external status register</description>
					<addressOffset>0x440</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT17</name>
					<description>Reset external status register</description>
					<addressOffset>0x0444</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT18</name>
					<description>Reset external status register</description>
					<addressOffset>0x0448</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT19</name>
					<description>Reset external status register</description>
					<addressOffset>0x044C</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT20</name>
					<description>Reset external status register</description>
					<addressOffset>0x0450</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT21</name>
					<description>Reset external status register</description>
					<addressOffset>0x0454</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT22</name>
					<description>Reset external status register</description>
					<addressOffset>0x0458</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT23</name>
					<description>Reset external status register</description>
					<addressOffset>0x045C</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT28</name>
					<description>Reset external status register</description>
					<addressOffset>0x470</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT32</name>
					<description>Reset external status register</description>
					<addressOffset>0x480</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT33</name>
					<description>Reset external status register</description>
					<addressOffset>0x0484</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT34</name>
					<description>Reset external status register</description>
					<addressOffset>0x0488</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT35</name>
					<description>Reset external status register</description>
					<addressOffset>0x048C</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT36</name>
					<description>Reset external status register</description>
					<addressOffset>0x0490</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT37</name>
					<description>Reset external status register</description>
					<addressOffset>0x0494</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT38</name>
					<description>Reset external status register</description>
					<addressOffset>0x0498</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT39</name>
					<description>Reset external status register</description>
					<addressOffset>0x049C</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT40</name>
					<description>Reset external status register</description>
					<addressOffset>0x04A0</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT41</name>
					<description>Reset external status register</description>
					<addressOffset>0x04A4</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT42</name>
					<description>Reset external status register</description>
					<addressOffset>0x04A8</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
