pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
						</field>
						<field>
							<name>TXMCENA</name>
							<description>Enable for the TX_MCLK output. When 0, output of TX_MCLK is not enabled. When 1, output of TX_MCLK is enabled.</description>
							<bitRange>[3:3]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>RXMODE</name>
					<description>I2S Receive mode control.</description>
					<addressOffset>0x034</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXCLKSEL</name>
							<description>Clock source selection for the receive bit clock divider.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SELECT_THE_RX_FRACTI</name>
									<description>Select the RX fractional rate divider clock output as the source</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SELECT_THE_TX_MCLK_S</name>
									<description>Select the TX_MCLK signal as the RX_MCLK clock source</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RX4PIN</name>
							<description>Receive 4-pin mode selection. When 1, enables 4-pin mode.</description>
							<bitRange>[2:2]</bitRange>
							
						</field>
						<field>
							<name>RXMCENA</name>
							<description>Enable for the RX_MCLK output. When 0, output of RX_MCLK is not enabled. When 1, output of RX_MCLK is enabled.</description>
							<bitRange>[3:3]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
							
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral derivedFrom="I2S0">
			<name>I2S1</name>
			<baseAddress>0x400A3000</baseAddress>
			<interrupt>
				<name>I2S1</name>
				<value>29</value>

			</interrupt>
		</peripheral>

		<peripheral>
			<name>C_CAN1</name>
			<description>Product name title=UM10430 Chapter title=LPC18xx C_CAN Modification date=1/18/2011 Major revision=0 Minor revision=7 </description>
			<groupName>C_CAN1</groupName>
			<baseAddress>0x400A4000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>C_CAN1</name>
				<value>43</value>

			</interrupt>
			<registers>
				<register>
					<name>CNTL</name>
					<description>CAN control</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x0001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INIT</name>
							<description>Initialization</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INITIALIZATION_IS_ST</name>
									<description>Initialization is started. On reset, software needs to initialize the CAN controller.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NORMAL_OPERATION_</name>
									<description>Normal operation.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IE</name>
							<description>Module interrupt enable</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE_CAN_INTERRUPT</name>
									<description>Enable CAN interrupts. The interrupt line is set to LOW and remains LOW until all pending interrupts are cleared.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE_CAN_INTERRUP</name>
									<description>Disable CAN interrupts. The interrupt line is always HIGH.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SIE</name>
							<description>Status change interrupt enable</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE_STATUS_CHANGE</name>
									<description>Enable status change interrupts. A status change interrupt will be generated when a message transfer is successfully completed or a CAN bus error is detected.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE_STATUS_CHANG</name>
									<description>Disable status change interrupts. No status change interrupt will be generated.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIE</name>
							<description>Error interrupt enable</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE_ERROR_INTERRU</name>
									<description>Enable error interrupt. A change in the bits BOFF or EWARN in the CANSTAT registers will generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE_ERROR_INTERR</name>
									<description>Disable error interrupt. No error status interrupt will be generated.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[4:4]</bitRange>
							
