pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
						</field>
						<field>
							<name>DAR</name>
							<description>Disable automatic retransmission</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Automatic retransmission disabled.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Automatic retransmission of disturbed messages enabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCE</name>
							<description>Configuration change enable</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_CPU_HAS_WRITE_AC</name>
									<description>The CPU has write access to the CANBT register while the INIT bit is one.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_CPU_HAS_NO_WRITE</name>
									<description>The CPU has no write access to the bit timing register.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TEST</name>
							<description>Test mode enable</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TEST_MODE_</name>
									<description>Test mode.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NORMAL_OPERATION_</name>
									<description>Normal operation.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[31:8]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>STAT</name>
					<description>Status register</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LEC</name>
							<description>Last error code Type of the last error to occur on the CAN bus.The LEC field holds a code which indicates the type of the last error to occur on the CAN bus. This field will be cleared to 0 when a message has been transferred (reception or transmission) without error. The unused code 111 may be written by the CPU to check for updates.</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_ERROR_</name>
									<description>No error.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STUFF_ERROR_MORE_TH</name>
									<description>Stuff error: More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FORM_ERROR_A_FIXED_</name>
									<description>Form error: A fixed format part of a received frame has the wrong format.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACKERROR_THE_MESSAG</name>
									<description>AckError: The message this CAN core transmitted was not acknowledged.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BIT1ERROR_DURING_TH</name>
									<description>Bit1Error: During the transmission of a message (with the exception of the arbitration field), the device wanted to send a HIGH/recessive level (bit of logical value 1), but the monitored bus value was LOW/dominant.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BIT0ERROR_DURING_TH</name>
									<description>Bit0Error: During the transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device wanted to send a LOW/dominant level (data or identifier bit logical value 0), but the monitored Bus value was HIGH/recessive. During busoff recovery this status is set each time a sequence of 11 HIGH/recessive bits has been monitored. This enables the CPU to monitor the proceeding of the busoff recovery sequence (indicating the bus is not stuck at LOW/dominant or continuously disturbed).</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CRCERROR_THE_CRC_CH</name>
									<description>CRCError: The CRC checksum was incorrect in the message received.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNUSED_NO_CAN_BUS_E</name>
									<description>Unused: No CAN bus event was detected (written by the CPU).</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXOK</name>
							<description>Transmitted a message successfully This bit is reset by the CPU. It is never reset by the CAN controller.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MSGTRANSFER</name>
									<description>Since this bit was last reset by the CPU, a message has been successfully transmitted (error free and acknowledged by at least one other node).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOMSGTRANSFER</name>
									<description>Since this bit was reset by the CPU, no message has been successfully transmitted.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXOK</name>
							<description>Received a message successfully This bit is reset by the CPU. It is never reset by the CAN controller.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MSGTRANSFER</name>
									<description>Since this bit was last set to zero by the CPU, a message has been successfully received independent of the result of acceptance filtering.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOMSGTRANSFER</name>
									<description>Since this bit was last reset by the CPU, no message has been successfully transmitted.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EPASS</name>
							<description>Error passive</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PASSIVE</name>
									<description>The CAN controller is in the error passive state as defined in the  CAN 2.0 specification.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>The CAN controller is in the error active state.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EWARN</name>
							<description>Warning status</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>AT_LEAST_ONE_OF_THE_</name>
									<description>At least one of the error counters in the EML has reached the error warning limit of 96.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BOTH_ERROR_COUNTERS_</name>
									<description>Both error counters are below the error warning limit of 96.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BOFF</name>
							<description>Busoff status</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>BUSOFF</name>
									<description>The CAN controller is in busoff state.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOBUSOFF</name>
									<description>The CAN module is not in busoff.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[31:8]</bitRange>
							
