pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[31:8]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x60</dimIncrement>
					<dimIndex>1-2</dimIndex>
					<name>IF%s_CMDMSK_R</name>
					<description>Message interface  command mask (read direction)</description>
					<alternateRegister>IF%s_CMDMSK_W</alternateRegister>
					<addressOffset>0x024</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA_B</name>
							<description>Access data bytes 4-7</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TRANSFER_DATA_BYTES_</name>
									<description>Transfer data bytes 4-7 to IFx message buffer register.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DATA_BYTES_4_7_UNCHA</name>
									<description>data bytes 4-7 unchanged.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DATA_A</name>
							<description>Access data bytes 0-3</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TRANSFER_DATA_BYTES_</name>
									<description>Transfer data bytes 0-3 to IFx message buffer.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DATA_BYTES_0_3_UNCHA</name>
									<description>data bytes 0-3 unchanged.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NEWDAT</name>
							<description>Access new data bit</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CLEAR_NEWDAT_BIT_IN_</name>
									<description>Clear NEWDAT bit in the message object.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NEWDAT_BIT_REMAINS_U</name>
									<description>NEWDAT bit remains unchanged. A read access to a message object can be combined with the reset of the control bits INTPND and NEWDAT in IF1/2_MCTRL. The values of these bits transferred to the IFx Message Control Register always reflect the status before resetting these bits.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLRINTPND</name>
							<description>Clear interrupt pending bit.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CLEAR_INTPND_BIT_IN_</name>
									<description>Clear INTPND bit in the message object.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTPND_BIT_REMAINS_U</name>
									<description>INTPND bit remains unchanged.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CTRL</name>
							<description>Access control bits</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TRANSFER_CONTROL_BIT</name>
									<description>Transfer control bits to IFx message buffer.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CONTROL_BITS_UNCHANG</name>
									<description>Control bits unchanged.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ARB</name>
							<description>Access arbitration bits</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TRANSFER_IDENTIFIER,</name>
									<description>Transfer Identifier, DIR, XTD, and MSGVAL bits to IFx message buffer register.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ARBITRATION_BITS_UNC</name>
									<description>Arbitration bits unchanged.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MASK</name>
							<description>Access mask bits</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TRANSFER_IDENTIFIER_</name>
									<description>Transfer Identifier MASK + MDIR + MXTD to IFx message buffer register.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MASK_BITS_UNCHANGED_</name>
									<description>Mask bits unchanged.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WR_RD</name>
							<description>Read transfer Transfer data from the message object addressed by the command request register to the selected message buffer registers CANIFn_CMDREQ.</description>
							<bitRange>[7:7]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[31:8]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x60</dimIncrement>
					<dimIndex>1-2</dimIndex>
					<name>IF%s_MSK1</name>
					<description>Message interface  mask 1</description>
					<addressOffset>0x028</addressOffset>
					<access>read-write</access>
					<resetValue>0xFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MSK15_0</name>
							<description>Identifier mask 0 = The corresponding bit in the identifier of the message can not inhibit the match in the acceptance filtering. 1 = The corresponding identifier bit is used for acceptance filtering.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x60</dimIncrement>
					<dimIndex>1-2</dimIndex>
					<name>IF%s_MSK2</name>
					<description>Message interface 1 mask 2</description>
					<addressOffset>0x02C</addressOffset>
					<access>read-write</access>
					<resetValue>0xFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MSK28_16</name>
							<description>Identifier mask 0 = The corresponding bit in the identifier of the message can not inhibit the match in the acceptance filtering. 1 = The corresponding identifier bit is used for acceptance filtering.</description>
							<bitRange>[12:0]</bitRange>
							
