pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
				</field>
			</fields>
		</register>
		<register>
			<name>VADC_TRIGGER_IN</name>
			<description>VADC trigger input multiplexer (GIMA output 24)</description>
			<addressOffset>0x060</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>INV</name>
					<description>Invert input</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_INVERTED_</name>
							<description>Not inverted.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_INVERTED_</name>
							<description>Input inverted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EDGE</name>
					<description>Enable rising edge detection</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_EDGE_DETECTION_</name>
							<description>No edge detection.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGE_DETECTIO</name>
							<description>Rising edge detection enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SYNCH</name>
					<description>Enable   synchronization</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE__SYNCHRONIZ</name>
							<description>Disable   synchronization.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE__SYNCHRONIZA</name>
							<description>Enable   synchronization.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PULSE</name>
					<description>Enable single pulse generation.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_SINGLE_PULSE</name>
							<description>Disable single pulse generation.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_SINGLE_PULSE_</name>
							<description>Enable single pulse generation.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SELECT</name>
					<description>Select input. Values 0xA to 0xF are reserved.</description>
					<bitRange>[7:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>GPIO6[28]</name>
							<description>GPIO6[28]</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>GPIO5[3]</name>
							<description>GPIO5[3]</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SGPIO10</name>
							<description>SGPIO10</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SGPIO12</name>
							<description>SGPIO12</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>MCOB2</name>
							<description>MCOB2</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CTOUT_0_OR_T0_MAT0</name>
							<description>CTOUT_0 or T0_MAT0</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CTOUT_8_OR_T2_MAT0</name>
							<description>CTOUT_8 or T2_MAT0</description>
							<value>0x7</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>T0_MAT0</name>
							<description>T0_MAT0</description>
							<value>0x8</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>T2_MAT0</name>
							<description>T2_MAT0</description>
							<value>0x9</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>EVENTROUTER_13_IN</name>
			<description>Event router   input 13 multiplexer (GIMA output 25)</description>
			<addressOffset>0x064</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>INV</name>
					<description>Invert input</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_INVERTED_</name>
							<description>Not inverted.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_INVERTED_</name>
							<description>Input inverted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EDGE</name>
					<description>Enable rising edge detection</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_EDGE_DETECTION_</name>
							<description>No edge detection.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGE_DETECTIO</name>
							<description>Rising edge detection enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SYNCH</name>
					<description>Enable   synchronization</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE__SYNCHRONIZ</name>
							<description>Disable   synchronization.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE__SYNCHRONIZA</name>
							<description>Enable   synchronization.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PULSE</name>
					<description>Enable single pulse generation.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_SINGLE_PULSE</name>
							<description>Disable single pulse generation.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_SINGLE_PULSE_</name>
							<description>Enable single pulse generation.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SELECT</name>
					<description>Select input. Values 0x3 to 0xF are reserved.</description>
					<bitRange>[7:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CTOUT_2_OR_T0_MAT2</name>
							<description>CTOUT_2 or T0_MAT2</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SGPIO3</name>
							<description>SGPIO3</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>T0_MAT2</name>
							<description>T0_MAT2</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
										

