pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
				</field>
			</fields>
		</register>
		<register>
			<name>SR</name>
			<description>SPI Status Register. This register shows the status of the SPI.</description>
			<addressOffset>0x004</addressOffset>
			<access>read-only</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[2:0]</bitRange>
				</field>
				<field>
					<name>ABRT</name>
					<description>Slave abort. When 1, this bit indicates that a slave abort has occurred. This bit is cleared by reading this register.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>MODF</name>
					<description>Mode fault. when 1, this bit indicates that a Mode fault error has occurred. This bit is cleared by reading this register, then writing the SPI0 control register.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>ROVR</name>
					<description>Read overrun. When 1, this bit indicates that a read overrun has occurred. This bit is cleared by reading this register.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>WCOL</name>
					<description>Write collision. When 1, this bit indicates that a write collision has occurred. This bit is cleared by reading this register, then accessing the SPI Data Register.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>SPIF</name>
					<description>SPI transfer complete flag. When 1, this bit indicates when a SPI data transfer is complete. When a master, this bit is set at the end of the last cycle of the transfer. When a slave, this bit is set on the last data sampling edge of the SCK. This bit is cleared by first reading this register, then accessing the SPI Data Register. Note: this is not the SPI interrupt flag. This flag is found in the SPINT register.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DR</name>
			<description>SPI Data Register. This bi-directional register provides the transmit and receive data for the SPI. Transmit data is provided to the SPI0 by writing to this register. Data received by the SPI0 can be read from this register.</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DATALOW</name>
					<description>SPI Bi-directional data port.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>DATAHIGH</name>
					<description>If bit 2 of the SPCR is 1 and bits 11:8 are other than 1000, some or all of these bits contain the additional transmit and receive bits. When less than 16 bits are selected, the more significant among these bits read as zeroes.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CCR</name>
			<description>SPI Clock Counter Register. This register controls the frequency of a master's SCK0.</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>COUNTER</name>
					<description>SPI0 Clock counter setting.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TCR</name>
			<description>SPI Test Control register. For functional testing only.</description>
			<addressOffset>0x010</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>TEST</name>
					<description>SPI test mode. When 0, the SPI operates normally. When 1, SCK will always be on, independent of master mode select and data availability setting.</description>
					<bitRange>[7:1]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TSR</name>
			<description>SPI Test Status register. For functional testing only.</description>
			<addressOffset>0x014</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[2:0]</bitRange>
				</field>
				<field>
					<name>ABRT</name>
					<description>Slave abort.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>MODF</name>
					<description>Mode fault.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>ROVR</name>
					<description>Read overrun.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>WCOL</name>
					<description>Write collision.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>SPIF</name>
					<description>SPI transfer complete flag.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INT</name>
			<description>SPI Interrupt Flag. This register contains the interrupt flag for the SPI interface.</description>
			<addressOffset>0x01C</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SPIF</name>
					<description>SPI interrupt flag. Set by the SPI interface to generate an interrupt. Cleared by writing a 1 to this bit. Note: this bit will be set once when SPIE = 1 and at least one of SPIF and WCOL bits is 1. However, only when the SPI Interrupt bit is set and SPI0 Interrupt is enabled in the NVIC, SPI based interrupt can be processed by interrupt handling software.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[7:1]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
