pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
				</field>
			</fields>
		</register>
		<register>
			<dim>16</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-15</dimIndex>
			<name>SLICE_MUX_CFG%s</name>
			<description>Slice multiplexer configuration registers.</description>
			<addressOffset>0x0080</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MATCH_MODE</name>
					<description>Match mode</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DO_NOT_MATCH_DATA_</name>
							<description>Do not match data.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>MATCH_DATA_</name>
							<description>Match data.</description>
							<value>0x1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CLK_CAPTURE_MODE</name>
					<description>Capture clock mode</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>USE_RISING_CLOCK_EDG</name>
							<description>Use rising clock edge.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USE_FALLING_CLOCK_ED</name>
							<description>Use falling clock edge.</description>
							<value>0x1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CLKGEN_MODE</name>
					<description>Clock generation mode</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>USE_CLOCK_INTERNALLY</name>
							<description>Use clock internally generated by COUNTER.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USE_EXTERNAL_CLOCK_F</name>
							<description>Use external clock from a pin or other slice.</description>
							<value>0x1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INV_OUT_CLK</name>
					<description>Invert output clock</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NORMAL_CLOCK_</name>
							<description>Normal clock.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INVERTED_CLOCK_</name>
							<description>Inverted clock.</description>
							<value>0x1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DATA_CAPTURE_MODE</name>
					<description>Condition for input bit match interrupt</description>
					<bitRange>[5:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DETECT_RISING_EDGE_</name>
							<description>Detect rising edge.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DETECT_FALLING_EDGE_</name>
							<description>Detect falling edge.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DETECT_LOW_LEVEL_</name>
							<description>Detect LOW level.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DETECT_HIGH_LEVEL_</name>
							<description>Detect HIGH level.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PARALLEL_MODE</name>
					<description>Parallel mode</description>
					<bitRange>[7:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SHIFT_1_BIT_PER_CLOC</name>
							<description>Shift 1 bit per clock.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SHIFT_2_BITS_PER_CLO</name>
							<description>Shift 2 bits per clock.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SHIFT_4_BITS_PER_CLO</name>
							<description>Shift 4 bits per clock.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SHIFT_1_BYTE_PER_CLO</name>
							<description>Shift 1 byte per clock.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INV_QUALIFIER</name>
					<description>Inversion qualifier</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>USE_NORMAL_QUALIFIER</name>
							<description>Use normal qualifier.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USE_INVERTED_QUALIFI</name>
							<description>Use inverted qualifier.</description>
							<value>0x1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:9]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<dim>16</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-15</dimIndex>
			<name>REG%s</name>
			<description>Slice data registers. Each
time COUNT0 reaches 0x0 the register shifts loading bit 31 with
data captured from DIN(n). DOUT(n) is set to REG(0)</description>
			<addressOffset>0x00C0</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>REG</name>
					<description>At each active shift clock the register shifts right;  loading REG(31) with data captured from DIN(n) and  DOUT(n) is set to REG(0).</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>16</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-15</dimIndex>
			<name>REG_SS%s</name>
			<description>Slice data shadow registers. Each time POS
reaches 0x0 the contents of REG_SS is exchanged with the content
of REG</description>
			<addressOffset>0x0100</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>REG_SS</name>
					<description>Each time POS reaches 0x0 the contents of REG_SS  is exchanged with the content of REG.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>16</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-15</dimIndex>
			<name>PRESET%s</name>
			<description>Reload value
of COUNT0, loaded when COUNT0 reaches 0x0</description>
			<addressOffset>0x0140</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PRESET</name>
					<description>Counter reload value; loaded when COUNT reaches  0x0.</description>
					<bitRange>[11:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:12]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>16</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-15</dimIndex>
			<name>COUNT%s</name>
			<description>Down counter, counts down each clock cycle.</description>
			<addressOffset>0x0180</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>COUNT</name>
					<description>Down counter, counts down each shift clock cycle.  Next count after 0x0 is PRESET.</description>
					<bitRange>[11:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:12]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>16</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-15</dimIndex>
			<name>POS%s</name>
			<description>Each time COUNT0 reaches 0x0</description>
			<addressOffset>0x01C0</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>POS</name>
					<description>Each time COUNT reaches 0x0 POS counts down.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>POS_RESET</name>
					<description>Reload value for POS after POS reaches 0x0.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MASK_A</name>
			<description>Mask for pattern match function of slice A</description>
			<addressOffset>0x0200</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MASK_A0</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>MASK_A1</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>MASK_A2</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>MASK_A3</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>MASK_A4</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>MASK_A5</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>MASK_A6</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>MASK_A7</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>MASK_A8</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>MASK_A9</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>MASK_A10</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>MASK_A11</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>MASK_A12</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>MASK_A13</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>MASK_A14</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>MASK_A15</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>MASK_A16</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>MASK_A17</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>MASK_A18</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>MASK_A19</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>MASK_A20</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>MASK_A21</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>MASK_A22</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>MASK_A23</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>MASK_A24</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>MASK_A25</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>MASK_A26</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>MASK_A27</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>MASK_A28</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>MASK_A29</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>MASK_A30</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>MASK_A31</name>
					<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MASK_H</name>
			<description>Mask for pattern match function of slice H</description>
			<addressOffset>0x0204</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MASK_H0</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>MASK_H1</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>MASK_H2</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>MASK_H3</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>MASK_H4</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>MASK_H5</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>MASK_H6</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>MASK_H7</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>MASK_H8</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>MASK_H9</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>MASK_H10</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>MASK_H11</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>MASK_H12</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>MASK_H13</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>MASK_H14</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>MASK_H15</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>MASK_H16</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>MASK_H17</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>MASK_H18</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>MASK_H19</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>MASK_H20</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>MASK_H21</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>MASK_H22</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>MASK_H23</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>MASK_H24</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>MASK_H25</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>MASK_H26</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>MASK_H27</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>MASK_H28</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>MASK_H29</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>MASK_H30</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>MASK_H31</name>
					<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
