pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
		<register>
			<name>MASK_I</name>
			<description>Mask for pattern match function of slice I</description>
			<addressOffset>0x0208</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MASK_I0</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>MASK_I1</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>MASK_I2</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>MASK_I3</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>MASK_I4</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>MASK_I5</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>MASK_I6</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>MASK_I7</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>MASK_I8</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>MASK_I9</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>MASK_I10</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>MASK_I11</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>MASK_I12</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>MASK_I13</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>MASK_I14</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>MASK_I15</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>MASK_I16</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>MASK_I17</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>MASK_I18</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>MASK_I19</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>MASK_I20</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>MASK_I21</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>MASK_I22</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>MASK_I23</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>MASK_I24</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>MASK_I25</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>MASK_I26</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>MASK_I27</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>MASK_I28</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>MASK_I29</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>MASK_I30</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>MASK_I31</name>
					<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MASK_P</name>
			<description>Mask for pattern match function of slice P</description>
			<addressOffset>0x020C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MASK_P0</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>MASK_P1</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>MASK_P2</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>MASK_P3</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>MASK_P4</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>MASK_P5</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>MASK_P6</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>MASK_P7</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>MASK_P8</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>MASK_P9</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>MASK_P10</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>MASK_P11</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>MASK_P12</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>MASK_P13</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>MASK_P14</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>MASK_P15</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>MASK_P16</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>MASK_P17</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>MASK_P18</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>MASK_P19</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>MASK_P20</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>MASK_P21</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>MASK_P22</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>MASK_P23</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>MASK_P24</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>MASK_P25</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>MASK_P26</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>MASK_P27</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>MASK_P28</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>MASK_P29</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>MASK_P30</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>MASK_P31</name>
					<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>GPIO_INREG</name>
			<description>GPIO input status register</description>
			<addressOffset>0x0210</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>GPIO_IN0</name>
					<description>Bit i reflects the input state of SGPIO pin i . 0 = LOW 1 = HIGH</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>GPIO_IN1</name>
					<description>Bit i reflects the input state of SGPIO pin i . 0 = LOW 1 = HIGH</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>GPIO_IN2</name>
					<description>Bit i reflects the input state of SGPIO pin i . 0 = LOW 1 = HIGH</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>GPIO_IN3</name>
					<description>Bit i reflects the input state of SGPIO pin i . 0 = LOW 1 = HIGH</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>GPIO_IN4</name>
					<description>Bit i reflects the input state of SGPIO pin i . 0 = LOW 1 = HIGH</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>GPIO_IN5</name>
					<description>Bit i reflects the input state of SGPIO pin i . 0 = LOW 1 = HIGH</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>GPIO_IN6</name>
					<description>Bit i reflects the input state of SGPIO pin i . 0 = LOW 1 = HIGH</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>GPIO_IN7</name>
					<description>Bit i reflects the input state of SGPIO pin i . 0 = LOW 1 = HIGH</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>GPIO_IN8</name>
					<description>Bit i reflects the input state of SGPIO pin i . 0 = LOW 1 = HIGH</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>GPIO_IN9</name>
					<description>Bit i reflects the input state of SGPIO pin i . 0 = LOW 1 = HIGH</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>GPIO_IN10</name>
					<description>Bit i reflects the input state of SGPIO pin i . 0 = LOW 1 = HIGH</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>GPIO_IN11</name>
					<description>Bit i reflects the input state of SGPIO pin i . 0 = LOW 1 = HIGH</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>GPIO_IN12</name>
					<description>Bit i reflects the input state of SGPIO pin i . 0 = LOW 1 = HIGH</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>GPIO_IN13</name>
					<description>Bit i reflects the input state of SGPIO pin i . 0 = LOW 1 = HIGH</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>GPIO_IN14</name>
					<description>Bit i reflects the input state of SGPIO pin i . 0 = LOW 1 = HIGH</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>GPIO_IN15</name>
					<description>Bit i reflects the input state of SGPIO pin i . 0 = LOW 1 = HIGH</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>GPIO_OUTREG</name>
			<description>GPIO output control register</description>
			<addressOffset>0x0214</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>GPIO_OUT0</name>
					<description>GPIO output register. Bit i sets the output of SGPIO pin i. 0 = LOW 1 = HIGH</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>GPIO_OUT1</name>
					<description>GPIO output register. Bit i sets the output of SGPIO pin i. 0 = LOW 1 = HIGH</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>GPIO_OUT2</name>
					<description>GPIO output register. Bit i sets the output of SGPIO pin i. 0 = LOW 1 = HIGH</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>GPIO_OUT3</name>
					<description>GPIO output register. Bit i sets the output of SGPIO pin i. 0 = LOW 1 = HIGH</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>GPIO_OUT4</name>
					<description>GPIO output register. Bit i sets the output of SGPIO pin i. 0 = LOW 1 = HIGH</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>GPIO_OUT5</name>
					<description>GPIO output register. Bit i sets the output of SGPIO pin i. 0 = LOW 1 = HIGH</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>GPIO_OUT6</name>
					<description>GPIO output register. Bit i sets the output of SGPIO pin i. 0 = LOW 1 = HIGH</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>GPIO_OUT7</name>
					<description>GPIO output register. Bit i sets the output of SGPIO pin i. 0 = LOW 1 = HIGH</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>GPIO_OUT8</name>
					<description>GPIO output register. Bit i sets the output of SGPIO pin i. 0 = LOW 1 = HIGH</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>GPIO_OUT9</name>
					<description>GPIO output register. Bit i sets the output of SGPIO pin i. 0 = LOW 1 = HIGH</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>GPIO_OUT10</name>
					<description>GPIO output register. Bit i sets the output of SGPIO pin i. 0 = LOW 1 = HIGH</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>GPIO_OUT11</name>
					<description>GPIO output register. Bit i sets the output of SGPIO pin i. 0 = LOW 1 = HIGH</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>GPIO_OUT12</name>
					<description>GPIO output register. Bit i sets the output of SGPIO pin i. 0 = LOW 1 = HIGH</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>GPIO_OUT13</name>
					<description>GPIO output register. Bit i sets the output of SGPIO pin i. 0 = LOW 1 = HIGH</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>GPIO_OUT14</name>
					<description>GPIO output register. Bit i sets the output of SGPIO pin i. 0 = LOW 1 = HIGH</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>GPIO_OUT15</name>
					<description>GPIO output register. Bit i sets the output of SGPIO pin i. 0 = LOW 1 = HIGH</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
