pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
		<register>
			<name>GPIO_OENREG</name>
			<description>GPIO OE control register</description>
			<addressOffset>0x0218</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>GPIO_OE0</name>
					<description>Bit i selects the output enable state of SGPIO pin i. 0 = GPIO output i is tri-state . 1 = GPIO output i is active.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>GPIO_OE1</name>
					<description>Bit i selects the output enable state of SGPIO pin i. 0 = GPIO output i is tri-state . 1 = GPIO output i is active.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>GPIO_OE2</name>
					<description>Bit i selects the output enable state of SGPIO pin i. 0 = GPIO output i is tri-state . 1 = GPIO output i is active.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>GPIO_OE3</name>
					<description>Bit i selects the output enable state of SGPIO pin i. 0 = GPIO output i is tri-state . 1 = GPIO output i is active.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>GPIO_OE4</name>
					<description>Bit i selects the output enable state of SGPIO pin i. 0 = GPIO output i is tri-state . 1 = GPIO output i is active.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>GPIO_OE5</name>
					<description>Bit i selects the output enable state of SGPIO pin i. 0 = GPIO output i is tri-state . 1 = GPIO output i is active.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>GPIO_OE6</name>
					<description>Bit i selects the output enable state of SGPIO pin i. 0 = GPIO output i is tri-state . 1 = GPIO output i is active.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>GPIO_OE7</name>
					<description>Bit i selects the output enable state of SGPIO pin i. 0 = GPIO output i is tri-state . 1 = GPIO output i is active.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>GPIO_OE8</name>
					<description>Bit i selects the output enable state of SGPIO pin i. 0 = GPIO output i is tri-state . 1 = GPIO output i is active.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>GPIO_OE9</name>
					<description>Bit i selects the output enable state of SGPIO pin i. 0 = GPIO output i is tri-state . 1 = GPIO output i is active.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>GPIO_OE10</name>
					<description>Bit i selects the output enable state of SGPIO pin i. 0 = GPIO output i is tri-state . 1 = GPIO output i is active.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>GPIO_OE11</name>
					<description>Bit i selects the output enable state of SGPIO pin i. 0 = GPIO output i is tri-state . 1 = GPIO output i is active.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>GPIO_OE12</name>
					<description>Bit i selects the output enable state of SGPIO pin i. 0 = GPIO output i is tri-state . 1 = GPIO output i is active.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>GPIO_OE13</name>
					<description>Bit i selects the output enable state of SGPIO pin i. 0 = GPIO output i is tri-state . 1 = GPIO output i is active.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>GPIO_OE14</name>
					<description>Bit i selects the output enable state of SGPIO pin i. 0 = GPIO output i is tri-state . 1 = GPIO output i is active.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>GPIO_OE15</name>
					<description>Bit i selects the output enable state of SGPIO pin i. 0 = GPIO output i is tri-state . 1 = GPIO output i is active.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CTRL_ENABLED</name>
			<description>Enables the slice COUNT counter</description>
			<addressOffset>0x021C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CTRL_ENABLED0</name>
					<description>Slice count enable. Bit n controls slice n (0 = slice A, ..., 15 = slice P). 0 = . 1 = Enables COUNTn.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>CTRL_ENABLED1</name>
					<description>Slice count enable. Bit n controls slice n (0 = slice A, ..., 15 = slice P). 0 = . 1 = Enables COUNTn.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>CTRL_ENABLED2</name>
					<description>Slice count enable. Bit n controls slice n (0 = slice A, ..., 15 = slice P). 0 = . 1 = Enables COUNTn.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>CTRL_ENABLED3</name>
					<description>Slice count enable. Bit n controls slice n (0 = slice A, ..., 15 = slice P). 0 = . 1 = Enables COUNTn.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CTRL_ENABLED4</name>
					<description>Slice count enable. Bit n controls slice n (0 = slice A, ..., 15 = slice P). 0 = . 1 = Enables COUNTn.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CTRL_ENABLED5</name>
					<description>Slice count enable. Bit n controls slice n (0 = slice A, ..., 15 = slice P). 0 = . 1 = Enables COUNTn.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>CTRL_ENABLED6</name>
					<description>Slice count enable. Bit n controls slice n (0 = slice A, ..., 15 = slice P). 0 = . 1 = Enables COUNTn.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>CTRL_ENABLED7</name>
					<description>Slice count enable. Bit n controls slice n (0 = slice A, ..., 15 = slice P). 0 = . 1 = Enables COUNTn.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>CTRL_ENABLED8</name>
					<description>Slice count enable. Bit n controls slice n (0 = slice A, ..., 15 = slice P). 0 = . 1 = Enables COUNTn.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>CTRL_ENABLED9</name>
					<description>Slice count enable. Bit n controls slice n (0 = slice A, ..., 15 = slice P). 0 = . 1 = Enables COUNTn.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>CTRL_ENABLED10</name>
					<description>Slice count enable. Bit n controls slice n (0 = slice A, ..., 15 = slice P). 0 = . 1 = Enables COUNTn.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>CTRL_ENABLED11</name>
					<description>Slice count enable. Bit n controls slice n (0 = slice A, ..., 15 = slice P). 0 = . 1 = Enables COUNTn.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>CTRL_ENABLED12</name>
					<description>Slice count enable. Bit n controls slice n (0 = slice A, ..., 15 = slice P). 0 = . 1 = Enables COUNTn.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>CTRL_ENABLED13</name>
					<description>Slice count enable. Bit n controls slice n (0 = slice A, ..., 15 = slice P). 0 = . 1 = Enables COUNTn.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>CTRL_ENABLED14</name>
					<description>Slice count enable. Bit n controls slice n (0 = slice A, ..., 15 = slice P). 0 = . 1 = Enables COUNTn.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>CTRL_ENABLED15</name>
					<description>Slice count enable. Bit n controls slice n (0 = slice A, ..., 15 = slice P). 0 = . 1 = Enables COUNTn.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CTRL_DISABLED</name>
			<description>Disables the slice COUNT counter</description>
			<addressOffset>0x0220</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CTRL_DISABLEDn0</name>
					<description>Slice count disable. Bit n controls slice n, (0 = slice A, ..., 15 = slice P). 0 =  1 = Disables COUNTn.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>CTRL_DISABLEDn1</name>
					<description>Slice count disable. Bit n controls slice n, (0 = slice A, ..., 15 = slice P). 0 =  1 = Disables COUNTn.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>CTRL_DISABLEDn2</name>
					<description>Slice count disable. Bit n controls slice n, (0 = slice A, ..., 15 = slice P). 0 =  1 = Disables COUNTn.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>CTRL_DISABLEDn3</name>
					<description>Slice count disable. Bit n controls slice n, (0 = slice A, ..., 15 = slice P). 0 =  1 = Disables COUNTn.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CTRL_DISABLEDn4</name>
					<description>Slice count disable. Bit n controls slice n, (0 = slice A, ..., 15 = slice P). 0 =  1 = Disables COUNTn.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CTRL_DISABLEDn5</name>
					<description>Slice count disable. Bit n controls slice n, (0 = slice A, ..., 15 = slice P). 0 =  1 = Disables COUNTn.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>CTRL_DISABLEDn6</name>
					<description>Slice count disable. Bit n controls slice n, (0 = slice A, ..., 15 = slice P). 0 =  1 = Disables COUNTn.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>CTRL_DISABLEDn7</name>
					<description>Slice count disable. Bit n controls slice n, (0 = slice A, ..., 15 = slice P). 0 =  1 = Disables COUNTn.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>CTRL_DISABLEDn8</name>
					<description>Slice count disable. Bit n controls slice n, (0 = slice A, ..., 15 = slice P). 0 =  1 = Disables COUNTn.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>CTRL_DISABLEDn9</name>
					<description>Slice count disable. Bit n controls slice n, (0 = slice A, ..., 15 = slice P). 0 =  1 = Disables COUNTn.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>CTRL_DISABLEDn10</name>
					<description>Slice count disable. Bit n controls slice n, (0 = slice A, ..., 15 = slice P). 0 =  1 = Disables COUNTn.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>CTRL_DISABLEDn11</name>
					<description>Slice count disable. Bit n controls slice n, (0 = slice A, ..., 15 = slice P). 0 =  1 = Disables COUNTn.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>CTRL_DISABLEDn12</name>
					<description>Slice count disable. Bit n controls slice n, (0 = slice A, ..., 15 = slice P). 0 =  1 = Disables COUNTn.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>CTRL_DISABLEDn13</name>
					<description>Slice count disable. Bit n controls slice n, (0 = slice A, ..., 15 = slice P). 0 =  1 = Disables COUNTn.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>CTRL_DISABLEDn14</name>
					<description>Slice count disable. Bit n controls slice n, (0 = slice A, ..., 15 = slice P). 0 =  1 = Disables COUNTn.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>CTRL_DISABLEDn15</name>
					<description>Slice count disable. Bit n controls slice n, (0 = slice A, ..., 15 = slice P). 0 =  1 = Disables COUNTn.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CLR_EN_0</name>
			<description>Shift clock interrupt clear mask</description>
			<addressOffset>0x0F00</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CLR_SCI0</name>
					<description>1 = Shift clock interrupt clear mask of slice n.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>CLR_SCI1</name>
					<description>1 = Shift clock interrupt clear mask of slice n.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>CLR_SCI2</name>
					<description>1 = Shift clock interrupt clear mask of slice n.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>CLR_SCI3</name>
					<description>1 = Shift clock interrupt clear mask of slice n.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CLR_SCI4</name>
					<description>1 = Shift clock interrupt clear mask of slice n.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CLR_SCI5</name>
					<description>1 = Shift clock interrupt clear mask of slice n.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>CLR_SCI6</name>
					<description>1 = Shift clock interrupt clear mask of slice n.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>CLR_SCI7</name>
					<description>1 = Shift clock interrupt clear mask of slice n.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>CLR_SCI8</name>
					<description>1 = Shift clock interrupt clear mask of slice n.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>CLR_SCI9</name>
					<description>1 = Shift clock interrupt clear mask of slice n.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>CLR_SCI10</name>
					<description>1 = Shift clock interrupt clear mask of slice n.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>CLR_SCI11</name>
					<description>1 = Shift clock interrupt clear mask of slice n.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>CLR_SCI12</name>
					<description>1 = Shift clock interrupt clear mask of slice n.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>CLR_SCI13</name>
					<description>1 = Shift clock interrupt clear mask of slice n.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>CLR_SCI14</name>
					<description>1 = Shift clock interrupt clear mask of slice n.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>CLR_SCI15</name>
					<description>1 = Shift clock interrupt clear mask of slice n.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SET_EN_0</name>
			<description>Shift clock interrupt set mask</description>
			<addressOffset>0x0F04</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SET_SCI0</name>
					<description>1 = Shift clock interrupt set mask of slice n.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>SET_SCI1</name>
					<description>1 = Shift clock interrupt set mask of slice n.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>SET_SCI2</name>
					<description>1 = Shift clock interrupt set mask of slice n.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>SET_SCI3</name>
					<description>1 = Shift clock interrupt set mask of slice n.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>SET_SCI4</name>
					<description>1 = Shift clock interrupt set mask of slice n.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>SET_SCI5</name>
					<description>1 = Shift clock interrupt set mask of slice n.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>SET_SCI6</name>
					<description>1 = Shift clock interrupt set mask of slice n.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>SET_SCI7</name>
					<description>1 = Shift clock interrupt set mask of slice n.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>SET_SCI8</name>
					<description>1 = Shift clock interrupt set mask of slice n.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>SET_SCI9</name>
					<description>1 = Shift clock interrupt set mask of slice n.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>SET_SCI10</name>
					<description>1 = Shift clock interrupt set mask of slice n.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>SET_SCI11</name>
					<description>1 = Shift clock interrupt set mask of slice n.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>SET_SCI12</name>
					<description>1 = Shift clock interrupt set mask of slice n.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>SET_SCI13</name>
					<description>1 = Shift clock interrupt set mask of slice n.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>SET_SCI14</name>
					<description>1 = Shift clock interrupt set mask of slice n.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>SET_SCI15</name>
					<description>1 = Shift clock interrupt set mask of slice n.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>ENABLE_0</name>
			<description>Shift clock interrupt enable</description>
			<addressOffset>0x0F08</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ENABLE_SCI0</name>
					<description>1 = Shift clock interrupt enable of slice n.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>ENABLE_SCI1</name>
					<description>1 = Shift clock interrupt enable of slice n.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>ENABLE_SCI2</name>
					<description>1 = Shift clock interrupt enable of slice n.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>ENABLE_SCI3</name>
					<description>1 = Shift clock interrupt enable of slice n.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>ENABLE_SCI4</name>
					<description>1 = Shift clock interrupt enable of slice n.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>ENABLE_SCI5</name>
					<description>1 = Shift clock interrupt enable of slice n.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>ENABLE_SCI6</name>
					<description>1 = Shift clock interrupt enable of slice n.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>ENABLE_SCI7</name>
					<description>1 = Shift clock interrupt enable of slice n.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>ENABLE_SCI8</name>
					<description>1 = Shift clock interrupt enable of slice n.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>ENABLE_SCI9</name>
					<description>1 = Shift clock interrupt enable of slice n.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>ENABLE_SCI10</name>
					<description>1 = Shift clock interrupt enable of slice n.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>ENABLE_SCI11</name>
					<description>1 = Shift clock interrupt enable of slice n.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>ENABLE_SCI12</name>
					<description>1 = Shift clock interrupt enable of slice n.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>ENABLE_SCI13</name>
					<description>1 = Shift clock interrupt enable of slice n.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>ENABLE_SCI14</name>
					<description>1 = Shift clock interrupt enable of slice n.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>ENABLE_SCI15</name>
					<description>1 = Shift clock interrupt enable of slice n.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
