pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
		<register>
			<name>STATUS_0</name>
			<description>Shift clock interrupt status</description>
			<addressOffset>0x0F0C</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>STATUS_SCI0</name>
					<description>Shift clock interrupt status of slice n.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>STATUS_SCI1</name>
					<description>Shift clock interrupt status of slice n.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>STATUS_SCI2</name>
					<description>Shift clock interrupt status of slice n.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>STATUS_SCI3</name>
					<description>Shift clock interrupt status of slice n.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>STATUS_SCI4</name>
					<description>Shift clock interrupt status of slice n.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>STATUS_SCI5</name>
					<description>Shift clock interrupt status of slice n.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>STATUS_SCI6</name>
					<description>Shift clock interrupt status of slice n.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>STATUS_SCI7</name>
					<description>Shift clock interrupt status of slice n.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>STATUS_SCI8</name>
					<description>Shift clock interrupt status of slice n.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>STATUS_SCI9</name>
					<description>Shift clock interrupt status of slice n.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>STATUS_SCI10</name>
					<description>Shift clock interrupt status of slice n.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>STATUS_SCI11</name>
					<description>Shift clock interrupt status of slice n.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>STATUS_SCI12</name>
					<description>Shift clock interrupt status of slice n.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>STATUS_SCI13</name>
					<description>Shift clock interrupt status of slice n.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>STATUS_SCI14</name>
					<description>Shift clock interrupt status of slice n.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>STATUS_SCI15</name>
					<description>Shift clock interrupt status of slice n.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CTR_STATUS_0</name>
			<description>Shift clock interrupt clear status</description>
			<addressOffset>0x0F10</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CTR_STATUS_SCI0</name>
					<description>Shift clock interrupt clear status of slice n.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI1</name>
					<description>Shift clock interrupt clear status of slice n.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI2</name>
					<description>Shift clock interrupt clear status of slice n.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI3</name>
					<description>Shift clock interrupt clear status of slice n.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI4</name>
					<description>Shift clock interrupt clear status of slice n.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI5</name>
					<description>Shift clock interrupt clear status of slice n.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI6</name>
					<description>Shift clock interrupt clear status of slice n.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI7</name>
					<description>Shift clock interrupt clear status of slice n.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI8</name>
					<description>Shift clock interrupt clear status of slice n.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI9</name>
					<description>Shift clock interrupt clear status of slice n.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI10</name>
					<description>Shift clock interrupt clear status of slice n.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI11</name>
					<description>Shift clock interrupt clear status of slice n.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI12</name>
					<description>Shift clock interrupt clear status of slice n.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI13</name>
					<description>Shift clock interrupt clear status of slice n.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI14</name>
					<description>Shift clock interrupt clear status of slice n.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI15</name>
					<description>Shift clock interrupt clear status of slice n.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SET_STATUS_0</name>
			<description>Shift clock interrupt set status</description>
			<addressOffset>0x0F14</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CTR_STATUS_SCI0</name>
					<description>Shift clock interrupt set status of slice n.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI1</name>
					<description>Shift clock interrupt set status of slice n.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI2</name>
					<description>Shift clock interrupt set status of slice n.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI3</name>
					<description>Shift clock interrupt set status of slice n.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI4</name>
					<description>Shift clock interrupt set status of slice n.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI5</name>
					<description>Shift clock interrupt set status of slice n.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI6</name>
					<description>Shift clock interrupt set status of slice n.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI7</name>
					<description>Shift clock interrupt set status of slice n.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI8</name>
					<description>Shift clock interrupt set status of slice n.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI9</name>
					<description>Shift clock interrupt set status of slice n.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI10</name>
					<description>Shift clock interrupt set status of slice n.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI11</name>
					<description>Shift clock interrupt set status of slice n.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI12</name>
					<description>Shift clock interrupt set status of slice n.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI13</name>
					<description>Shift clock interrupt set status of slice n.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI14</name>
					<description>Shift clock interrupt set status of slice n.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_SCI15</name>
					<description>Shift clock interrupt set status of slice n.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CLR_EN_1</name>
			<description>Capture clock interrupt clear mask</description>
			<addressOffset>0x0F20</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CLR_EN_CCI0</name>
					<description>1 = Capture clock interrupt clear mask of slice n.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>CLR_EN_CCI1</name>
					<description>1 = Capture clock interrupt clear mask of slice n.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>CLR_EN_CCI2</name>
					<description>1 = Capture clock interrupt clear mask of slice n.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>CLR_EN_CCI3</name>
					<description>1 = Capture clock interrupt clear mask of slice n.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CLR_EN_CCI4</name>
					<description>1 = Capture clock interrupt clear mask of slice n.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CLR_EN_CCI5</name>
					<description>1 = Capture clock interrupt clear mask of slice n.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>CLR_EN_CCI6</name>
					<description>1 = Capture clock interrupt clear mask of slice n.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>CLR_EN_CCI7</name>
					<description>1 = Capture clock interrupt clear mask of slice n.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>CLR_EN_CCI8</name>
					<description>1 = Capture clock interrupt clear mask of slice n.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>CLR_EN_CCI9</name>
					<description>1 = Capture clock interrupt clear mask of slice n.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>CLR_EN_CCI10</name>
					<description>1 = Capture clock interrupt clear mask of slice n.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>CLR_EN_CCI11</name>
					<description>1 = Capture clock interrupt clear mask of slice n.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>CLR_EN_CCI12</name>
					<description>1 = Capture clock interrupt clear mask of slice n.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>CLR_EN_CCI13</name>
					<description>1 = Capture clock interrupt clear mask of slice n.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>CLR_EN_CCI14</name>
					<description>1 = Capture clock interrupt clear mask of slice n.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>CLR_EN_CCI15</name>
					<description>1 = Capture clock interrupt clear mask of slice n.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SET_EN_1</name>
			<description>Capture clock interrupt set mask</description>
			<addressOffset>0x0F24</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SET_EN_CCI0</name>
					<description>1 = Capture clock interrupt set mask of slice n.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>SET_EN_CCI1</name>
					<description>1 = Capture clock interrupt set mask of slice n.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>SET_EN_CCI2</name>
					<description>1 = Capture clock interrupt set mask of slice n.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>SET_EN_CCI3</name>
					<description>1 = Capture clock interrupt set mask of slice n.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>SET_EN_CCI4</name>
					<description>1 = Capture clock interrupt set mask of slice n.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>SET_EN_CCI5</name>
					<description>1 = Capture clock interrupt set mask of slice n.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>SET_EN_CCI6</name>
					<description>1 = Capture clock interrupt set mask of slice n.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>SET_EN_CCI7</name>
					<description>1 = Capture clock interrupt set mask of slice n.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>SET_EN_CCI8</name>
					<description>1 = Capture clock interrupt set mask of slice n.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>SET_EN_CCI9</name>
					<description>1 = Capture clock interrupt set mask of slice n.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>SET_EN_CCI10</name>
					<description>1 = Capture clock interrupt set mask of slice n.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>SET_EN_CCI11</name>
					<description>1 = Capture clock interrupt set mask of slice n.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>SET_EN_CCI12</name>
					<description>1 = Capture clock interrupt set mask of slice n.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>SET_EN_CCI13</name>
					<description>1 = Capture clock interrupt set mask of slice n.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>SET_EN_CCI14</name>
					<description>1 = Capture clock interrupt set mask of slice n.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>SET_EN_CCI15</name>
					<description>1 = Capture clock interrupt set mask of slice n.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>ENABLE_1</name>
			<description>Capture clock interrupt enable</description>
			<addressOffset>0x0F28</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ENABLE_CCI0</name>
					<description>Capture clock interrupt enable of slice n.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>ENABLE_CCI1</name>
					<description>Capture clock interrupt enable of slice n.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>ENABLE_CCI2</name>
					<description>Capture clock interrupt enable of slice n.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>ENABLE_CCI3</name>
					<description>Capture clock interrupt enable of slice n.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>ENABLE_CCI4</name>
					<description>Capture clock interrupt enable of slice n.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>ENABLE_CCI5</name>
					<description>Capture clock interrupt enable of slice n.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>ENABLE_CCI6</name>
					<description>Capture clock interrupt enable of slice n.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>ENABLE_CCI7</name>
					<description>Capture clock interrupt enable of slice n.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>ENABLE_CCI8</name>
					<description>Capture clock interrupt enable of slice n.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>ENABLE_CCI9</name>
					<description>Capture clock interrupt enable of slice n.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>ENABLE_CCI10</name>
					<description>Capture clock interrupt enable of slice n.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>ENABLE_CCI11</name>
					<description>Capture clock interrupt enable of slice n.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>ENABLE_CCI12</name>
					<description>Capture clock interrupt enable of slice n.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>ENABLE_CCI13</name>
					<description>Capture clock interrupt enable of slice n.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>ENABLE_CCI14</name>
					<description>Capture clock interrupt enable of slice n.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>ENABLE_CCI15</name>
					<description>Capture clock interrupt enable of slice n.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STATUS_1</name>
			<description>Capture clock interrupt status</description>
			<addressOffset>0x0F2C</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>STATUS_CCI0</name>
					<description>Capture clock interrupt status of slice n.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>STATUS_CCI1</name>
					<description>Capture clock interrupt status of slice n.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>STATUS_CCI2</name>
					<description>Capture clock interrupt status of slice n.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>STATUS_CCI3</name>
					<description>Capture clock interrupt status of slice n.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>STATUS_CCI4</name>
					<description>Capture clock interrupt status of slice n.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>STATUS_CCI5</name>
					<description>Capture clock interrupt status of slice n.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>STATUS_CCI6</name>
					<description>Capture clock interrupt status of slice n.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>STATUS_CCI7</name>
					<description>Capture clock interrupt status of slice n.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>STATUS_CCI8</name>
					<description>Capture clock interrupt status of slice n.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>STATUS_CCI9</name>
					<description>Capture clock interrupt status of slice n.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>STATUS_CCI10</name>
					<description>Capture clock interrupt status of slice n.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>STATUS_CCI11</name>
					<description>Capture clock interrupt status of slice n.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>STATUS_CCI12</name>
					<description>Capture clock interrupt status of slice n.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>STATUS_CCI13</name>
					<description>Capture clock interrupt status of slice n.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>STATUS_CCI14</name>
					<description>Capture clock interrupt status of slice n.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>STATUS_CCI15</name>
					<description>Capture clock interrupt status of slice n.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
