pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
		<register>
			<name>CTR_STATUS_1</name>
			<description>Capture clock interrupt clear status</description>
			<addressOffset>0x0F30</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CTR_STATUS_CCI0</name>
					<description>Capture clock interrupt clear status of slice n.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI1</name>
					<description>Capture clock interrupt clear status of slice n.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI2</name>
					<description>Capture clock interrupt clear status of slice n.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI3</name>
					<description>Capture clock interrupt clear status of slice n.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI4</name>
					<description>Capture clock interrupt clear status of slice n.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI5</name>
					<description>Capture clock interrupt clear status of slice n.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI6</name>
					<description>Capture clock interrupt clear status of slice n.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI7</name>
					<description>Capture clock interrupt clear status of slice n.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI8</name>
					<description>Capture clock interrupt clear status of slice n.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI9</name>
					<description>Capture clock interrupt clear status of slice n.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI10</name>
					<description>Capture clock interrupt clear status of slice n.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI11</name>
					<description>Capture clock interrupt clear status of slice n.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI12</name>
					<description>Capture clock interrupt clear status of slice n.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI13</name>
					<description>Capture clock interrupt clear status of slice n.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI14</name>
					<description>Capture clock interrupt clear status of slice n.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI15</name>
					<description>Capture clock interrupt clear status of slice n.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SET_STATUS_1</name>
			<description>Capture clock interrupt set status</description>
			<addressOffset>0x0F34</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CTR_STATUS_CCI0</name>
					<description>Capture clock interrupt set status of slice n.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI1</name>
					<description>Capture clock interrupt set status of slice n.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI2</name>
					<description>Capture clock interrupt set status of slice n.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI3</name>
					<description>Capture clock interrupt set status of slice n.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI4</name>
					<description>Capture clock interrupt set status of slice n.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI5</name>
					<description>Capture clock interrupt set status of slice n.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI6</name>
					<description>Capture clock interrupt set status of slice n.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI7</name>
					<description>Capture clock interrupt set status of slice n.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI8</name>
					<description>Capture clock interrupt set status of slice n.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI9</name>
					<description>Capture clock interrupt set status of slice n.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI10</name>
					<description>Capture clock interrupt set status of slice n.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI11</name>
					<description>Capture clock interrupt set status of slice n.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI12</name>
					<description>Capture clock interrupt set status of slice n.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI13</name>
					<description>Capture clock interrupt set status of slice n.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI14</name>
					<description>Capture clock interrupt set status of slice n.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>CTR_STATUS_CCI15</name>
					<description>Capture clock interrupt set status of slice n.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CLR_EN_2</name>
			<description>Pattern match interrupt clear mask</description>
			<addressOffset>0x0F40</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CLR_EN2_PMI0</name>
					<description>1 = Match interrupt clear mask of slice n.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>CLR_EN2_PMI1</name>
					<description>1 = Match interrupt clear mask of slice n.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>CLR_EN2_PMI2</name>
					<description>1 = Match interrupt clear mask of slice n.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>CLR_EN2_PMI3</name>
					<description>1 = Match interrupt clear mask of slice n.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CLR_EN2_PMI4</name>
					<description>1 = Match interrupt clear mask of slice n.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CLR_EN2_PMI5</name>
					<description>1 = Match interrupt clear mask of slice n.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>CLR_EN2_PMI6</name>
					<description>1 = Match interrupt clear mask of slice n.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>CLR_EN2_PMI7</name>
					<description>1 = Match interrupt clear mask of slice n.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>CLR_EN2_PMI8</name>
					<description>1 = Match interrupt clear mask of slice n.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>CLR_EN2_PMI9</name>
					<description>1 = Match interrupt clear mask of slice n.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>CLR_EN2_PMI10</name>
					<description>1 = Match interrupt clear mask of slice n.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>CLR_EN2_PMI11</name>
					<description>1 = Match interrupt clear mask of slice n.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>CLR_EN2_PMI12</name>
					<description>1 = Match interrupt clear mask of slice n.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>CLR_EN2_PMI13</name>
					<description>1 = Match interrupt clear mask of slice n.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>CLR_EN2_PMI14</name>
					<description>1 = Match interrupt clear mask of slice n.</description>
					<bitRange>[14:14]</bitRange>
										
