pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
				</field>
				<field>
					<name>CLR_EN2_PMI15</name>
					<description>1 = Match interrupt clear mask of slice n.</description>
					<bitRange>[15:15]</bitRange>
										
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
										
				</field>
			</fields>
		</register>
		<register>
			<name>SET_EN_2</name>
			<description>Pattern match interrupt set mask</description>
			<addressOffset>0x0F44</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SET_EN_PMI0</name>
					<description>1 = Match interrupt set mask of slice n.</description>
					<bitRange>[0:0]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_PMI1</name>
					<description>1 = Match interrupt set mask of slice n.</description>
					<bitRange>[1:1]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_PMI2</name>
					<description>1 = Match interrupt set mask of slice n.</description>
					<bitRange>[2:2]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_PMI3</name>
					<description>1 = Match interrupt set mask of slice n.</description>
					<bitRange>[3:3]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_PMI4</name>
					<description>1 = Match interrupt set mask of slice n.</description>
					<bitRange>[4:4]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_PMI5</name>
					<description>1 = Match interrupt set mask of slice n.</description>
					<bitRange>[5:5]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_PMI6</name>
					<description>1 = Match interrupt set mask of slice n.</description>
					<bitRange>[6:6]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_PMI7</name>
					<description>1 = Match interrupt set mask of slice n.</description>
					<bitRange>[7:7]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_PMI8</name>
					<description>1 = Match interrupt set mask of slice n.</description>
					<bitRange>[8:8]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_PMI9</name>
					<description>1 = Match interrupt set mask of slice n.</description>
					<bitRange>[9:9]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_PMI10</name>
					<description>1 = Match interrupt set mask of slice n.</description>
					<bitRange>[10:10]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_PMI11</name>
					<description>1 = Match interrupt set mask of slice n.</description>
					<bitRange>[11:11]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_PMI12</name>
					<description>1 = Match interrupt set mask of slice n.</description>
					<bitRange>[12:12]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_PMI13</name>
					<description>1 = Match interrupt set mask of slice n.</description>
					<bitRange>[13:13]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_PMI14</name>
					<description>1 = Match interrupt set mask of slice n.</description>
					<bitRange>[14:14]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_PMI15</name>
					<description>1 = Match interrupt set mask of slice n.</description>
					<bitRange>[15:15]</bitRange>
										
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
										
				</field>
			</fields>
		</register>
		<register>
			<name>ENABLE_2</name>
			<description>Pattern match interrupt enable</description>
			<addressOffset>0x0F48</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ENABLE_PMI0</name>
					<description>Match interrupt enable of slice n.</description>
					<bitRange>[0:0]</bitRange>
										
				</field>
				<field>
					<name>ENABLE_PMI1</name>
					<description>Match interrupt enable of slice n.</description>
					<bitRange>[1:1]</bitRange>
										
				</field>
				<field>
					<name>ENABLE_PMI2</name>
					<description>Match interrupt enable of slice n.</description>
					<bitRange>[2:2]</bitRange>
										
				</field>
				<field>
					<name>ENABLE_PMI3</name>
					<description>Match interrupt enable of slice n.</description>
					<bitRange>[3:3]</bitRange>
										
				</field>
				<field>
					<name>ENABLE_PMI4</name>
					<description>Match interrupt enable of slice n.</description>
					<bitRange>[4:4]</bitRange>
										
				</field>
				<field>
					<name>ENABLE_PMI5</name>
					<description>Match interrupt enable of slice n.</description>
					<bitRange>[5:5]</bitRange>
										
				</field>
				<field>
					<name>ENABLE_PMI6</name>
					<description>Match interrupt enable of slice n.</description>
					<bitRange>[6:6]</bitRange>
										
				</field>
				<field>
					<name>ENABLE_PMI7</name>
					<description>Match interrupt enable of slice n.</description>
					<bitRange>[7:7]</bitRange>
										
				</field>
				<field>
					<name>ENABLE_PMI8</name>
					<description>Match interrupt enable of slice n.</description>
					<bitRange>[8:8]</bitRange>
										
				</field>
				<field>
					<name>ENABLE_PMI9</name>
					<description>Match interrupt enable of slice n.</description>
					<bitRange>[9:9]</bitRange>
										
				</field>
				<field>
					<name>ENABLE_PMI10</name>
					<description>Match interrupt enable of slice n.</description>
					<bitRange>[10:10]</bitRange>
										
				</field>
				<field>
					<name>ENABLE_PMI11</name>
					<description>Match interrupt enable of slice n.</description>
					<bitRange>[11:11]</bitRange>
										
				</field>
				<field>
					<name>ENABLE_PMI12</name>
					<description>Match interrupt enable of slice n.</description>
					<bitRange>[12:12]</bitRange>
										
				</field>
				<field>
					<name>ENABLE_PMI13</name>
					<description>Match interrupt enable of slice n.</description>
					<bitRange>[13:13]</bitRange>
										
