pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
				</field>
				<field>
					<name>CLR_EN_INPI11</name>
					<description>1 = Input interrupt clear mask of slice n.</description>
					<bitRange>[11:11]</bitRange>
										
				</field>
				<field>
					<name>CLR_EN_INPI12</name>
					<description>1 = Input interrupt clear mask of slice n.</description>
					<bitRange>[12:12]</bitRange>
										
				</field>
				<field>
					<name>CLR_EN_INPI13</name>
					<description>1 = Input interrupt clear mask of slice n.</description>
					<bitRange>[13:13]</bitRange>
										
				</field>
				<field>
					<name>CLR_EN_INPI14</name>
					<description>1 = Input interrupt clear mask of slice n.</description>
					<bitRange>[14:14]</bitRange>
										
				</field>
				<field>
					<name>CLR_EN_INPI15</name>
					<description>1 = Input interrupt clear mask of slice n.</description>
					<bitRange>[15:15]</bitRange>
										
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
										
				</field>
			</fields>
		</register>
		<register>
			<name>SET_EN_3</name>
			<description>Input bit match interrupt set mask</description>
			<addressOffset>0x0F64</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SET_EN_INPI0</name>
					<description>1 = Input interrupt set mask of slice n.</description>
					<bitRange>[0:0]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_INPI1</name>
					<description>1 = Input interrupt set mask of slice n.</description>
					<bitRange>[1:1]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_INPI2</name>
					<description>1 = Input interrupt set mask of slice n.</description>
					<bitRange>[2:2]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_INPI3</name>
					<description>1 = Input interrupt set mask of slice n.</description>
					<bitRange>[3:3]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_INPI4</name>
					<description>1 = Input interrupt set mask of slice n.</description>
					<bitRange>[4:4]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_INPI5</name>
					<description>1 = Input interrupt set mask of slice n.</description>
					<bitRange>[5:5]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_INPI6</name>
					<description>1 = Input interrupt set mask of slice n.</description>
					<bitRange>[6:6]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_INPI7</name>
					<description>1 = Input interrupt set mask of slice n.</description>
					<bitRange>[7:7]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_INPI8</name>
					<description>1 = Input interrupt set mask of slice n.</description>
					<bitRange>[8:8]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_INPI9</name>
					<description>1 = Input interrupt set mask of slice n.</description>
					<bitRange>[9:9]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_INPI10</name>
					<description>1 = Input interrupt set mask of slice n.</description>
					<bitRange>[10:10]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_INPI11</name>
					<description>1 = Input interrupt set mask of slice n.</description>
					<bitRange>[11:11]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_INPI12</name>
					<description>1 = Input interrupt set mask of slice n.</description>
					<bitRange>[12:12]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_INPI13</name>
					<description>1 = Input interrupt set mask of slice n.</description>
					<bitRange>[13:13]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_INPI14</name>
					<description>1 = Input interrupt set mask of slice n.</description>
					<bitRange>[14:14]</bitRange>
										
				</field>
				<field>
					<name>SET_EN_INPI15</name>
					<description>1 = Input interrupt set mask of slice n.</description>
					<bitRange>[15:15]</bitRange>
										
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
										
				</field>
			</fields>
		</register>
		<register>
			<name>ENABLE_3</name>
			<description>Input bit match interrupt enable</description>
			<addressOffset>0x0F68</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ENABLE3_INPI0</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[0:0]</bitRange>
										
				</field>
				<field>
					<name>ENABLE3_INPI1</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[1:1]</bitRange>
										
				</field>
				<field>
					<name>ENABLE3_INPI2</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[2:2]</bitRange>
										
				</field>
				<field>
					<name>ENABLE3_INPI3</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[3:3]</bitRange>
										
				</field>
				<field>
					<name>ENABLE3_INPI4</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[4:4]</bitRange>
										
				</field>
				<field>
					<name>ENABLE3_INPI5</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[5:5]</bitRange>
										
				</field>
				<field>
					<name>ENABLE3_INPI6</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[6:6]</bitRange>
										
				</field>
				<field>
					<name>ENABLE3_INPI7</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[7:7]</bitRange>
										
				</field>
				<field>
					<name>ENABLE3_INPI8</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[8:8]</bitRange>
										
				</field>
				<field>
					<name>ENABLE3_INPI9</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[9:9]</bitRange>
										
