pyocd/pyOCD/pyocd/debug/svd/data/LPC43xx_svd_v5.svd
				</field>
				<field>
					<name>CTR_STATUS_INPI9</name>
					<description>Input interrupt clear status of slice n.</description>
					<bitRange>[9:9]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI10</name>
					<description>Input interrupt clear status of slice n.</description>
					<bitRange>[10:10]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI11</name>
					<description>Input interrupt clear status of slice n.</description>
					<bitRange>[11:11]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI12</name>
					<description>Input interrupt clear status of slice n.</description>
					<bitRange>[12:12]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI13</name>
					<description>Input interrupt clear status of slice n.</description>
					<bitRange>[13:13]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI14</name>
					<description>Input interrupt clear status of slice n.</description>
					<bitRange>[14:14]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI15</name>
					<description>Input interrupt clear status of slice n.</description>
					<bitRange>[15:15]</bitRange>
										
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
										
				</field>
			</fields>
		</register>
		<register>
			<name>SET_STATUS_3</name>
			<description>Shift clock interrupt set status</description>
			<addressOffset>0x0F74</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CTR_STATUS_INPI0</name>
					<description>Shift interrupt set status of slice n.</description>
					<bitRange>[0:0]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI1</name>
					<description>Shift interrupt set status of slice n.</description>
					<bitRange>[1:1]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI2</name>
					<description>Shift interrupt set status of slice n.</description>
					<bitRange>[2:2]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI3</name>
					<description>Shift interrupt set status of slice n.</description>
					<bitRange>[3:3]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI4</name>
					<description>Shift interrupt set status of slice n.</description>
					<bitRange>[4:4]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI5</name>
					<description>Shift interrupt set status of slice n.</description>
					<bitRange>[5:5]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI6</name>
					<description>Shift interrupt set status of slice n.</description>
					<bitRange>[6:6]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI7</name>
					<description>Shift interrupt set status of slice n.</description>
					<bitRange>[7:7]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI8</name>
					<description>Shift interrupt set status of slice n.</description>
					<bitRange>[8:8]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI9</name>
					<description>Shift interrupt set status of slice n.</description>
					<bitRange>[9:9]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI10</name>
					<description>Shift interrupt set status of slice n.</description>
					<bitRange>[10:10]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI11</name>
					<description>Shift interrupt set status of slice n.</description>
					<bitRange>[11:11]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI12</name>
					<description>Shift interrupt set status of slice n.</description>
					<bitRange>[12:12]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI13</name>
					<description>Shift interrupt set status of slice n.</description>
					<bitRange>[13:13]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI14</name>
					<description>Shift interrupt set status of slice n.</description>
					<bitRange>[14:14]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI15</name>
					<description>Shift interrupt set status of slice n.</description>
					<bitRange>[15:15]</bitRange>
										
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
										
				</field>
			</fields>
		</register>
										
										
	</registers>
</peripheral>




	</peripherals>




</device>
